{"last_time_update": "2022-03-24 05:56:30", "results": [{"course_id": "4571294", "category": "IT & Software", "sub_category": "IT Certifications", "title": "AZ-300 & 303 : Azure Architect Technologies Practice Exams", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "5.0", "reviews": "3", "students": "3108", "coupon_code": "55D36AABAE807431DF9D", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/az-300-303-azure-architect-technologies-practice-exams-b/?couponCode=55D36AABAE807431DF9D", "end_day": "2022-03-28 18:56:00+00:00", "headline": "AZ-300 & 303 : Azure Architect Technologies Practice Exams 2022", "description": "<p><strong>Description</strong></p><p><br></p><p>A candidate for this exam should have advanced experience and knowledge across various aspects of IT operations, including networking, virtualization, identity, security, business continuity, disaster recovery, data management, budgeting, and governance–this role should manage how decisions in each area affect an overall solution. In addition, this role should be proficient in at least one of these Azure knowledge domains: administration, development, or DevOps, this exam should have subject matter expertise in designing and implementing solutions that run on Microsoft Azure, including aspects like compute, network, storage, and security and intermediate-level skills for administering Azure. Candidates should understand Azure development and DevOps processes.</p><p><br></p><p><strong> **AZ-300&nbsp; :</strong></p><ul><li><p>Azure Fundamentals</p></li><li><p>Analyze Resource Utilization and Consumption</p></li><li><p>Create and Configure Storage Accounts</p></li><li><p>Create and Configure Virtual Machines</p></li><li><p>Azure Virtual Networking</p></li><li><p>Managing and Securing Identities</p></li><li><p>Governance and RBAC Controls</p></li><li><p>Create and Deploy Apps</p></li><li><p>Serverless Computing</p></li><li><p>Design and Develop Apps that Run in Containers</p></li><li><p>Server Migrations</p></li><li><p>Automation</p></li></ul><p><strong>*Implement and monitor an Azure infrastructure </strong></p><p>Implement cloud infrastructure monitoring</p><p>Implement storage accounts</p><p>Implement VMs for Windows and Linux</p><p>Automate deployment and configuration of resources</p><p>Implement virtual networking</p><p><strong>*Implement management and security solutions </strong></p><p>Manage workloads in Azure</p><p>Implement load balancing and network security</p><p>Implement and manage Azure governance solutions</p><p>Manage security for applications</p><p><strong>*Implement solutions for apps </strong></p><p>Implement an application infrastructure</p><p>Implement container-based applications</p><p><strong>*Implement and manage data platforms </strong></p><p>Implement NoSQL databases</p><p>Implement Azure SQL databases</p><p> ***<strong>Objectives</strong></p><p>Azure AZ-303 /300 Exam</p><p>* Implement and monitor an Azure infrastructure (50-55%)</p><p>* Implement management and security solutions (25-30%)</p><p>* Implement solutions for apps (10-15%)</p><p>* Implement and manage data platforms (10-15%)<br></p>", "preview_video": ""}, {"course_id": "4435488", "category": "Finance & Accounting", "sub_category": "Finance", "title": "Fixed Income Securities: Become a Bond Analyst & Investor", "level": "Beginner Level", "author": "Meta Brains", "duration": "null", "rating": "4.4", "reviews": "83", "students": "17875", "coupon_code": "BAA320EDB5AF0247DB34", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/introduction-to-bonds/?couponCode=BAA320EDB5AF0247DB34", "end_day": "2022-03-28 01:16:00+00:00", "headline": "An Introduction to Bond Markets: Everything You Need to Know About Bonds", "description": "<p><strong>Investing in bonds has a lot of financial benefits for investors</strong>. It provides a regular stream of income and widens their investment portfolio. Bonds also carry low market volatility.</p><p>It is a safe investment plan which allows investors to preserve and increase their capital. Investing in top-quality government bonds doesn't come with a default risk for investors.</p><p>This course is for investors and individuals who show interest in widening their scope on the fundamentals of fixed-income instruments and exploring the structures and features of the market. If you are interested in learning about different topics and sections connected to the analysis and valuation of bonds, this course is for you.</p><p><strong>Dealing with fixed-income securities can be difficult if you are unwilling to invest your time and resources into the proper means</strong>. Making the seemingly cumbersome fixed-income securities easier is the idea behind this course.</p><p>It is accessible to everybody irrespective of their place of work or schedule. It doesn't matter if you are a beginner or conversant with the world of fixed-income securities. The course is designed to start from the basics and slowly advance as you get more familiar with the fundamentals.</p><p>Aside from teaching you the fundamentals of fixed-income securities, if you wish to venture into bonds, this course will teach you the basics and things you might need to get started. If you are on the lookout for a course that will impact financial skills applicable in the real world, look no further.</p><p>See you inside!<br></p>", "preview_video": ""}, {"course_id": "4586648", "category": "IT & Software", "sub_category": "IT Certifications", "title": "Professional Scrum Master I (PSM I): Practice Exams", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "3.5", "reviews": "1", "students": "2154", "coupon_code": "B4E0C90DDE55735BAE48", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/professional-scrum-master-i-psm-i-practice-exams/?couponCode=B4E0C90DDE55735BAE48", "end_day": "2022-03-28 18:54:00+00:00", "headline": "[New] Professional Scrum Master I (PSM I): Practice Exams 2022", "description": "<p><strong>Description</strong></p><p>Scrum is the most popular agile framework !!!</p><p><strong>Course includes:</strong></p><ul><li><p>5 Practice Tests</p></li><li><p>Multiple choice format questions</p></li><li><p>Multiple select format questions</p></li><li><p>True or False format questions</p></li></ul><p><strong>Topics</strong>:</p><ul><li><p>Scrum Framework</p><p> this is foundational knowledge for every Scrum Team member. </p><p><br></p></li><li><p>Scrum Theory and Principles: </p><p>this topic is more about understanding Scrum theory</p></li></ul><p><br></p><ul><li><p>Cross-Functional, Self-Organizing Teams: </p><p>Questions here cover how Scrum Teams are different from traditional development teams:cross-functional, self-empowered, and self-organizing people promote flexibility, creativity, and productivity.</p><p><br></p></li><li><p>Coaching and Facilitation: </p><p>Questions here are about how the mindset and behavior of Scrum Master are different from traditional Project Manager: by acting as a Servant Leader, the Scrum Master facilitates and coaches full organizations in understanding and using Scrum</p></li></ul><p><br></p><p>Most recent studies say that 66% of agile frameworks users use it. 14% of agile teams combine this framework with Scrumban or XP practices. </p><p>PSM stands for Professional Scrum Master, a certification for the professionals who is going to work in an Agile Scrum environment. </p><p>It is also valuable for people who are already working in Agile environment and try to find solution to their previous process problems. This agile method enables agile teams’ to respond and adapt quickly.</p><p>The Professional Scrum Master I&nbsp; course is for anyone involved in product development using the Scrum Framework.</p><p><br></p>", "preview_video": ""}, {"course_id": "1639290", "category": "IT & Software", "sub_category": "IT Certifications", "title": "Mastering The Complete Agile Scrum Master Workshop", "level": "All Levels", "author": "Tanmay Panchal", "duration": "null", "rating": "3.9", "reviews": "783", "students": "107669", "coupon_code": "0E2E1FC3E9FF9078AEF8", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/mastering-agile-scrum-workshop/?couponCode=0E2E1FC3E9FF9078AEF8", "end_day": "2022-03-28 10:10:00+00:00", "headline": "Learn Agile Scrum Master Concepts for 2020 & 2021", "description": "<p>UPDATE FOR 2020 &amp; 2021 with Tanmay's latest knowledge on <strong>Agile Scrum Master Certification</strong>!</p><p>This course is about learning the latest <strong>Agile Scrum Methodology</strong> for the <strong>Software Development </strong>field. In this course, you will learn all other Agile methodologies along with detailed information on Scrum.</p><p>This course helps the students in understanding the fundamental principles that form the foundation of <strong>Agile</strong>. The course also explores the <strong>Scrum framework</strong> in deep detail and also blends an overview of the key <strong>practices for Agile</strong>. The course starts off with an introduction to <strong>the most frequently used agile framework</strong> with over 70% of <strong>agile projects using Scrum</strong> in one form or another, then it goes on to the real-world examples to enable the students to apply the knowledge to solve real problems.</p><p><strong>Scrum </strong>is the <strong>agile development process</strong> that allows teams to deliver usable software periodically throughout the life of the project, dynamically absorbing change and new requirements as the project proceeds. The course covers the <strong>Agile Scrum Master Certification</strong> curriculum in detail and enables the students to clear the exam.</p><p>By this course, experienced project managers can grow in their careers and get the next level of opportunity as an <strong>Agile Scrum Master</strong> and the junior team members can learn the process of the <strong>Agile Scrum methodology.</strong></p><p>This course will give insight necessary to achieve the <strong>Agile Scrum Master roles</strong> along with the fundamentals of <strong>Agile Scrum Master&nbsp;methodology </strong>for you to adopt into your organization. Also, you will be able to gain a 100% understanding of how to apply <strong>SCRUM</strong> by understanding <strong>Product Backlog, Epics, Story Points, Sprints, SCRUM&nbsp;lifecycle, Roles of Scrum Team/Product Owner and Scrum Master.</strong></p><p>By this course, you will be an effective servant leader and <strong>Scrum Master.</strong></p><p>The biggest target audience is at any experience level who wants to learn <strong>Agile Scrum</strong> in detail and apply in the career to grow or in the organization to grow!!!</p><p><strong>Course Value</strong></p><p>As a project management professional, you can derive value from this course in multiple ways</p><ul><li><p>You learn best practices for <strong>Scrum</strong> and other <strong>Agile methods</strong></p></li><li><p>You will gain deep insight into Scrum and discover new ways of leading project management teams and delivering values to customers</p></li><li><p>You will receive practical guidance on how to implement these practices within your organization and how to maximize their value</p></li><li><p>It positions you well to be an evangelist and champion in the Agile adoption journey for your organization</p></li></ul><p><strong>Topics Covered in this Course</strong></p><p>These are the topics covered in the course</p><ul><li><p>We will define what Agile is. Review the <strong>Agile manifesto</strong>, 12 supporting principles in Agile. We will also explore the journey as a successful Agile and Scrum adoption.</p></li><li><p>We will cover the Waterfall project management approach as well as becoming familiar with a number of other agile frameworks including Lean, XP, Kanban, Crystal, and DSDM. We will also cover how DevOps as an engineering discipline compliments Agile by accelerating the delivery and deployment of valuable software. Furthermore, we will review how agile should be linked with IT service management.</p></li><li><p>We will cover scrum value, scrum pillar, scrum lifecycle, and scrum ceremony including sprint planning, daily scrum, sprint reviews, and spring retrospectives. We will also cover various scrum artifacts including the product backlog, sprint backlog, and release backlog.</p></li><li><p>We will cover <strong>scrum roles.</strong> A <strong>product owner</strong>, the <strong>scrum master</strong>, and <strong>the development team</strong>. We will focus more on the <strong>scrum master role</strong> including some of the dos and don’ts.</p></li><li><p>We will cover the <strong>user stories, epics, and user story part</strong>. We will talk about the <strong>product roadmap</strong> as well as the release and <strong>sprint plan</strong>. We will also cover the estimation techniques including story points and ideal time. We discuss planning poker and affinity estimates. Will talk about information radiator and communicating project progress and status including burndown chart, burn-up charts, and other information radiators. We will also talk about a scrum team that stays in control of the project work by making form decisions in a collaborative way with key stakeholders.</p></li><li><p>We are going to explore some of the common challenges and counters while <strong>scaling agile</strong> for use in large projects. To explain the scrum of scrum works and as well how product co-ordination teams and feature teams co-ordinate the work of multiple teams working on a single project. Will explain how scrum is implemented in a distributed environment. We will talk about the SAFe framework and how to scale agile. Will talk about system thinking and determining when agile should be used and when it should not be. Will cover how tools can be used in Scrum to improve performance.</p></li></ul>", "preview_video": ""}, {"course_id": "4393210", "category": "Business", "sub_category": "E-Commerce", "title": "The Complete Introduction to Online Course Creation", "level": "Beginner Level", "author": "Yassin Marco", "duration": "null", "rating": "3.9", "reviews": "33", "students": "14607", "coupon_code": "DE586A38462C555AF5D8", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/the-complete-introduction-to-online-course-creation/?couponCode=DE586A38462C555AF5D8", "end_day": "2022-03-28 02:15:00+00:00", "headline": "Learn all the basics of starting your own online course business", "description": "<p><strong>Why am I qualified to teach this course:</strong></p><p>My name is Yassin Marco and I will be your instructor for this course. I have been an online course instructor for many years and as of today I have over 25 online courses on various plateforms as well as over 1.1 million unique students on udemy alone. My courses have been taken by people all over the world and have helped many in different fields. Over the time I received a lot of questions about how I started in this field and someone can also start out in the course creation world. So I deceided to create a course that contains everything about this topic. My goal with this course is really to help you understand all the aspects of this business model and helping you start out as a course creator and helping you share your skills with other and beeing able to monetize them.</p><p><strong>Course Presentation</strong></p><p>Creating an online course is not an easy task and can sometimes get really complicated especially if you have no prior experience in this field. But, don't worry, this course has everything you need to start your very own and first online course. Indeed, you will learn many interesting things about this business model. If you:</p><p>- Are someone interested in teaching your skills to others</p><p>- Want to create your first online business</p><p>- Launching your own teaching plateform</p><p>- Are simply interested by the topic and want to learn more about it</p><p>Then you will love this course. Not only you will have by the end of the course a very strong understanding of how to crate your course since I will teach you everything that I personnaly do but you will also be able to create your course from scratch, launch it on various marketplaces, create your plateform and finally promote your course.</p><p><strong>The structure of the course</strong></p><p>The way this course is created is really done to help you learn all the basics of course creation and launching your first online business in this field. From the basic theory and course plan creation to launching your course, your plateform and promoting everything you created, everything in this course is structured to help you learn and achieve your goal of understanding how you can work with this business model. In this course, you will also learn how to work with various plateforms or marketplaces and what exactly you should take into consideration to succed in this type of business. The objective of the course is simple, teaching you everything you need to know to become more efficient when you are creating your first online course.</p><p>Also, this course is built on a concept of learning by practice. In other words, even if there is a lot of theory, you will have a lot of examples and practice. This way, you will have a better understanding of this topic and reach your full potential when you will grow your teaching business .</p><p><strong>For who is this course designed</strong></p><p>There are many course creation courses out there, but this one is different. Indeed, this online course creation course will teach you with clear and simple examples all the basics of to start a business in this field. Also, since this course is an introduction to the topic it's perfect for people that have no prior experience with this business model, teaching or creating an online course. Indeed, even if you never had or created an online business before, you will have a solide understanding of the topic. The goal of this course is really teaching you how to think like an experienced online course creator and showing you all the tips and tricks to start out with this business model.</p><p><strong>Why should I take this course</strong></p><p>If you want to start your first online course then you should definely take this course. Not only you will learn how to create an online course from scratch but you will also be able to promote it on different plateforms, marketplaces as well as your own plateform. Indeed, by the end of this course you will have the required knowledge to start in the online business world and be able to grow your brand.</p><p><strong>There is no risk involved in taking this course</strong></p><p>This course comes with a 100% satisfaction guarantee, this means that if your are not happy with what you have learned, you have <strong>30 days </strong>to get a complete refund with no questions asked. Also, if there is any concept that you find complicated or you are just not able to understand, you can directly contact me and it will be my pleasure to support you in your learning.</p><p>This means that you can either learn amazing skills that can be very useful in your professional or everyday life or you can simply try the course and if you don't like it for any reason ask for a refund.</p><p><strong>You can't lose with this type of offer !!</strong></p><p><strong>ENROL NOW and start learning today :)</strong></p>", "preview_video": ""}, {"course_id": "4605272", "category": "Teaching & Academics", "sub_category": "Social Science", "title": "Organized Crime Essentials", "level": "Beginner Level", "author": "Dr Ian Messenger", "duration": "null", "rating": "0.0", "reviews": "0", "students": "1283", "coupon_code": "85F138D8AFCE5F705D01", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/organized-crime-essentials/?couponCode=85F138D8AFCE5F705D01", "end_day": "2022-03-27 18:42:00+00:00", "headline": "Describing, Defining and Assessing Organized Crime", "description": "<p>This course examines the many forms of organized crime in Canada (mafia, outlaw motorcycle gangs, Asian triads, etc.) to offer students a solid understanding of the various crime groups, their organizations, history, and activity, and the threats they post.</p><p>Students will examine the use of major case management when investigating organized crime and the issues of disclosure.&nbsp; </p><p>The phenomenon of transnational organized crime will be explored with a focus on its threat to national security and linkages to terrorism. </p><p>By the end of this course, students will develop a comprehensive understanding of organized crime through a study of relevant material and a practical understanding of methods and techniques used for detecting and conducting investigations to counter organized crime.</p><p><br></p><p>Course Objectives</p><p>1. Evaluate the main approaches to organized crime.</p><p>2. Assess organized crime groups, their activities and their effect on society.</p><p>3. Analyze counter organized and transnational organized crime policies, laws and methods </p><p>4. Evaluate current “indicators and warnings” methods for identifying organized and transnational organized crime activity.</p><p>5. Assess the current trends in organized and transnational organized crime that illustrates the historical development of terrorism.</p><p>6. Examine the nexus between organized crime and terrorism and the efforts to detect and combat this activity.</p><p>7. Explain the challenges with intelligence collection, major case management, and disclosure when conducting investigations into organized crime activity</p>", "preview_video": ""}, {"course_id": "4575406", "category": "Business", "sub_category": "E-Commerce", "title": "The Complete Shopify Dropshipping Ecommerce Course 2022", "level": "Beginner Level", "author": "Rayan Malik - Start & Grow Ecommerce Ltd", "duration": "null", "rating": "0.0", "reviews": "0", "students": "876", "coupon_code": "WOWFREE", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/the-complete-shopify-dropshipping-ecommerce-course/?couponCode=WOWFREE", "end_day": "2022-03-28 16:34:00+00:00", "headline": "Build a successful & highly profitable Shopify dropshipping business from home in 2022.", "description": "<p>Welcome to the Complete Shopify Dropshipping Ecommerce Course (Updated March 2022). Dropshipping &amp; Ecommerce is taking the world by storm with the global e-commerce sales to hit $7.4 trillion by 2025.<br></p><p>Are you Interested in Building Your Own Aliexpress Dropshipping Ecommerce Business? In this Course you will learn how dropshipping works and how you can find the perfect product to sell online.<br><br>I'm going to teach you step-by-step, how you can build a highly profitable eCommerce store, from scratch. You don't need any prior skills or knowledge of eCommerce, as long as you can use a computer you are good to go.</p><p><br></p><p>The course is designed with the total beginner in mind. Some of the things you will learn:</p><ul><li><p>How to Find Hugely Profitable Products for Shopify Dropshipping &amp; Build a Worldwide Brand</p></li><li><p>How to Find World class suppliers &amp; Get the best quality+price from them</p></li><li><p>Complete Branding &amp; Online store setup Step by Step (no technical skills required)</p></li><li><p>How to Import products &amp; Customer reviews to your store</p></li><li><p>And Creating Facebook, Instagram &amp; Email campaigns to get sales in your store!</p></li></ul><p>I have used the exact same methods to build several online brands ourselves and generate millions of dollars in sales. If I can do this then you can too so what are you waiting for? Start building your profitable eCommerce business today and Take your Business to the NEXT LEVEL</p><p><br></p><p><br></p>", "preview_video": ""}, {"course_id": "4472640", "category": "Teaching & Academics", "sub_category": "Science", "title": "Carbon Neutrality Fundamentals", "level": "Beginner Level", "author": "Mike L", "duration": "null", "rating": "3.6", "reviews": "14", "students": "3916", "coupon_code": "6960289D0A64C3FCC516", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/carbon-neutrality-fundamentals/?couponCode=6960289D0A64C3FCC516", "end_day": "2022-03-26 21:09:00+00:00", "headline": "Learn how we can have a carbon free and sustainable future for our next generation!", "description": "<p>Carbon Neutrality Fundamentals is a comprehensive video course where you can learn important knowledge about carbon neutrality and how you can contribute to a better.</p><p>I have handcrafted this course to allow students to acquire core fundamental knowledge from carbon neutral basic to best practices in contributing to a carbon neutral future.</p><p>I will teach you the basic concepts of the different greenhouse gasses as well as the different energy options that we have. I will also go over the different aspects of our lives, from transportation to shopping to our food and point out what you can do in your current lifestyle to support our carbon neutral future.</p><p>If you are an environmentally conscious individual who are interested in getting in-depth knowledge as to how you can make this world a better place and more sustainable, you will find this course of great help to get the fundamental knowledge you need to modify your lifestyle.</p><p>This course can help you be inform of what is happening in our environment and what we can do to ensure there is a sustainable green environment for our future generations. And knowledge is power.</p><p><br></p><p>So let's get started! Let's start your fulfilling journey and mark an important point of our world by taking the appropriate actions to ensure a carbon-free future!</p>", "preview_video": ""}, {"course_id": "4604244", "category": "IT & Software", "sub_category": "IT Certifications", "title": "AZ-104: Microsoft Azure Administrator Exam Prep 2022.", "level": "All Levels", "author": "Hajar Izmousse", "duration": "null", "rating": "0.0", "reviews": "0", "students": "340", "coupon_code": "D3A1CF1EA7DAF499F6F3", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/az-104-microsoft-azure-fundamentals-exam-prep-2022/?couponCode=D3A1CF1EA7DAF499F6F3", "end_day": "2022-03-29 01:45:00+00:00", "headline": "Are you ready to pass your  AZ 104 exam? prove it. if you scored more than 85% then YES YOU ARE!", "description": "<p>&nbsp; &nbsp; &nbsp; looking for some good practice tests to test your&nbsp; knowledge on AZ-104 exam? Looking for valid AZ-104 exam questions to practice? you are in the right place. we prepared 6 excellent practice tests (more than 300 question):</p><ol><li><p>To stimulate your knowledge and challenge your skills.</p></li><li><p>To make sure that you are ready and fully prepared to pass your exam.</p></li></ol><p><strong>The Microsoft Azure Administrator AZ-104 practice test challenges learners to demonstrate their understanding of the AZ-104.</strong></p><p><br></p><p><strong>Are you ready for the exam?</strong></p><ul><li><p><strong>Certification Provider:</strong> Microsoft</p></li><li><p><strong>Exam:</strong> Microsoft Azure Administrator</p></li><li><p><strong>Duration of each test:</strong> 2 Hours</p></li><li><p><strong>Number of questions in total:</strong> 300+</p></li><li><p><strong>Exam Version:</strong> 2022</p></li><li><p><strong>Language:</strong> English</p><p><br></p></li></ul><p>These <strong>AZ-104 Microsoft Azure Administrator practice tests</strong> are patterned after the latest exam format and updated regularly based on the feedback of our students on what appeared in the actual exam.</p><p>We are guiding you through the exam objectives, demonstrating key concepts and hands-on skills required for exam success just by the carefully chosen questions.</p><p>The practice tests (as available) are designed to help candidates prepare for and pass the Microsoft exams. The practice test measures your ability to accomplish technical tasks and understand relevant concepts. The purpose of this Sample Question Set is to provide you with information about the Microsoft Azure Administrator exam. These sample questions will make you very familiar with both the type and the difficulty level of the questions on the AZ-104 certification test.</p><p><strong>Good luck!</strong></p><p><br></p>", "preview_video": ""}, {"course_id": "3373624", "category": "Personal Development", "sub_category": "Personal Productivity", "title": "Focus Mastery: Focus 100% On Your Goals & Kill Distractions", "level": "All Levels", "author": "Claudia Simonetto", "duration": "null", "rating": "3.8", "reviews": "468", "students": "54250", "coupon_code": "12C8EB2E38D136F557AB", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/productivity-hacks-to-improve-focus-and-concentration/?couponCode=12C8EB2E38D136F557AB", "end_day": "2022-03-28 15:20:00+00:00", "headline": "A Complete Training To Effectively Increase Your Concentration and Focus By Boosting Your Personal Productivity.", "description": "<p><strong>Productivity Hacks To Improve Focus And Concentration</strong></p><p><em>A Complete Training To Effectively Increase Your Concentration and Focus By Boosting Your Personal Productivity.</em><br></p><p>Doing twice the work in half the time is just the LAST step of achieving long-term success for your personal and professional goals. </p><p><strong>Before boosting your productivity, you need to increase your focus and concentration by eliminating all those useless activities that have nothing to do with your goals</strong>: time wasters and distractions.</p><p>First you need to eliminate distractions, prioritize tasks and improve concentration, then you can focus on developing self-discipline and boosting productivity.</p><p><br></p><p>This course will teach you <strong>how to focus on what really matters to achieve your goals by increasing productivity, prioritizing high-value tasks and getting rid of time wasters.</strong></p><p>Check the time you spend every day focusing your attention on social media or watching videos of someone else's life: is that time useful for achieving your personal or professional goals?</p><p>This focus + productivity formula will solve the root cause of wasting time: reset your priorities and get results faster!</p><p><strong>What will you be able to do upon completion of this course?</strong></p><ul><li><p><em>How To Identify And Focus On The High-Value Actions That Improve Your Performance And Results</em></p></li><li><p><em>Reset Your Priorities, Redirect Focus And Get the Right Things Done</em></p></li><li><p><em>Stop Procrastinating and Complete your To-Do List Every Day By Mastering Self-Discipline</em></p></li><li><p><em>Create A Daily Success Routine Based on Your Personal and Professional Goals</em></p></li><li><p><em>Develop The Productivity Mindset for Long Term Success</em></p></li><li><p><em>Get Rid Of Time-Wasting Habits and Improve Your Concentration At Home</em></p></li><li><p><em>Kill Distractions, Achieve Deep Focus and Become 10x More Productive At Work</em></p></li><li><p><em>Effective Ways To Meet Your Deadlines Every Time</em></p></li><li><p><em>Boost Productivity to Achieve More in Less Time</em></p></li><li><p><em>Improve Your Work Environment and Optimize Productivity</em></p></li><li><p><em>Powerful Concentration Techniques To Learn Faster and Improve Memory</em></p><p><br></p></li></ul><p><strong>What you'll find in the course:</strong></p><p><strong>Getting Started: Improve Focus by Eliminating What Prevents You From Reaching Your Goals</strong></p><p><em>Create high performance habits that will make you successful, get rid of time wasters that hold you back from meeting your deadlines and improve concentration to get twice the work done in half the time. Kill distractions and stay focused on what really matters to achieve both your personal and professional goals.</em></p><ul><li><p><strong>Productivity Killers: How To Identify Time Wasters And Get Rid Of Them</strong> - How to identify your personal productivity killers and how to eliminate them to improve concentration</p></li><li><p><strong>The 8 Wastes In Everyday Life: Opportunities For Improvement</strong> - Every time you identify waste, identify an opportunity and plan for change</p></li><li><p><strong>Parkinson’s Law: How Focus And Time Management Can Improve Your Life</strong> - Manage your time more effectively and improve concentration and shartp your attention at home and work</p></li><li><p><strong>Mental Focus: 6 Effective Ways To Set and Meet Deadlines Every Time</strong> - How focus and concentration are essential to meet deadlines within specified periods of time</p></li><li><p><strong>5 Ways to Kill Distractions To Improve Concentration</strong> - Focus on the essentials, avoid distractions and stop procrastinating</p></li></ul><p><br></p><p><strong>The Next Level: Multiply Your Productivity And Achieve More in Less Time</strong></p><p><em>Golden rules to achieve deep focus, improve your concentration, do the right things at the right time, boost your productivity and train your brain to learn faster. High productivity techniques to improve your work performance and maximize results.</em></p><ul><li><p><strong>Achieve Deep Focus And Improve Your Work Performance</strong> - How to Effectively Improve Your Concentration and Work Better</p></li><li><p><strong>The Art Of Doing One Thing At A Time</strong> - You Can Achieve Anything If You Focus On ONE Thing.</p></li><li><p><strong>What Time Of Day Are You Most Productive?</strong> - The Best Time Of The Day To Study Or To Work: Day or Night? You can find your most productive work times and patterns just by paying closer attention to your daily habits.</p></li><li><p><strong>Create a More Productive Work Environment: Say Goodbye To The Boring Office </strong>- Boost your workplace productivity: how much work is accomplished in a particular work environment, over a particular period of time?</p></li><li><p><strong>Top 3 Laws Of Productivity To Improve Efficiency </strong>- The Laws Of Productivity You Should Apply To Work Smarter, Not Harder</p></li><li><p><strong>Conquer Your Concentration: 4 Strategies For Training Your Brain To Learn Faster</strong> - How To Improve Your Concentration By Training Your Brain With These Learning Strategies</p><p><br></p></li></ul><p><strong>BONUS MATERIAL</strong></p><p>From theory to practice: downloadable resources to use as a reference and exercises designed to put into practice what you have learned in order to maximize your chances of success by developing goal-oriented productive habits.</p><p><br></p><p><strong>ENROLL NOW! </strong>Stop wasting time and start investing it!</p>", "preview_video": ""}, {"course_id": "3890452", "category": "Teaching & Academics", "sub_category": "Engineering", "title": "Fundamental Question on Ethical Hacking", "level": "All Levels", "author": "Harish Kumar Maheshwari", "duration": "null", "rating": "4.5", "reviews": "83", "students": "19593", "coupon_code": "5C3C24D2A318C88661E3", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/fundamental-question-on-ethical-hacking/?couponCode=5C3C24D2A318C88661E3", "end_day": "2022-03-28 17:43:00+00:00", "headline": "Multiple Choice Questions (MCQ) on Ethical Hacking", "description": "<p>Dear Students,</p><p><strong>Are you Preparing for Interview in Ethical Hacking? Don’t be stressed, take our</strong> <strong>Ethical Hacking quiz and prepare yourself for the Interview.</strong></p><p>With this Ethical Hacking Quiz, we are going to build your confidence by providing tips and trick to solve Ethical Hacking based questions. Here you will get Ethical Hacking based MCQ for your next Job or exam. In Ethical Hacking Quiz, there will be a series of practice tests where you can test your Knowledge in the field of Ethical Hacking.</p><p><strong>Advantages of our Ethical Hacking Online MCQ Test</strong></p><ul><li><p>It contains sample questions which are likely to be asked in the real exam and Interview.</p></li><li><p>These Ethical Hacking MCQ questions help you with self-study and self-assessment</p></li><li><p>These Quiz helps you check your knowledge.</p></li><li><p>It helps you enhance the confidence during the Real exam and Interview.</p></li></ul><p>In This Quiz We covers the Following Topics in Ethical hacking Such as: Hacker Types, Famous Hackers, Terminologies, Tools, Skills, Process, Reconnaissance, Fingerprinting, Sniffing, Sniffing Tools, ARP Poisoning, DNS poisoning, Enumeration, Trojan Attacks, Email Hacking, Password Hacking, Wireless hacking, Cross Site Scripting, etc.</p><p>Generally, you need to refer a variety of books and Websites in order to cover the ocean of topics in<strong> Ethical Hacking</strong>. To make it easy for you guys, I have collected a few <strong>Ethical Hacking</strong> Based questions from different topics<strong>, when you solve these Questions then definitely your confidence will Increase.</strong></p><p><strong>This type of Q&amp;A really crucial for your real exam. </strong></p><p><strong>Also this course has 30 days money back guarantee </strong></p><p><strong>Without any delay, the applicants participate in the Ethical Hacking Test and understand the various questions and answers.</strong></p><p><strong>Best of luck!</strong></p><p><strong>CHEERS!</strong></p>", "preview_video": ""}, {"course_id": "3941854", "category": "IT & Software", "sub_category": "Other IT & Software", "title": "Excel Profesional 2022– Para Empresas!", "level": "Intermediate Level", "author": "David Godeau", "duration": "null", "rating": "4.7", "reviews": "910", "students": "41554", "coupon_code": "16C851D629EB19AFF14D", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/2021-curso-profesional-excel-para-empresas/?couponCode=16C851D629EB19AFF14D", "end_day": "2022-03-28 15:52:00+00:00", "headline": "Adquiere Conocimientos Indispensables de Excel en el Mundo Empresarial. ¡El Curso Excel Más Actualizado Este 2022!⭐", "description": "<p>El curso te proporciona los <strong>cimientos que todo Profesional Excel debe poseer</strong>. Obtendrás un vasto conocimiento lleno de recursos y estarás capacitado para hacer frente a cualquier tarea en Excel de una manera eficaz y productiva.</p><p>Al terminar el curso, habrás dominado Excel y nada te será desconocido para empezar a trabajar <strong>como todo un Profesional</strong>.</p><p>El curso Incluye:</p><p>⭐ <strong>Más de 8 Horas de Contenido Exclusivo</strong></p><p>⭐ <strong>Tareas Prácticas Al Final de Cada Capitulo (Desafíos)</strong></p><p>⭐ <strong>Más de 50 Videos</strong> <strong>en Alta Definición (HD)</strong></p><p>⭐ El <strong>Guía de Apuntes</strong> de consulta rápida en <em>formato PDF.</em></p><p>⭐ <strong>Certificado digital</strong> de finalización. </p><p>⭐ <strong>Acceso ilimitado</strong></p><p>⭐ <strong>Asistencia personal</strong></p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;_____________________________________</p><p><strong>PORQUÉ TOMAR&nbsp;ESTE&nbsp;CURSO?</strong></p><p>Profesionales con habilidades y destrezas en Excel siempre están <strong>en demanda por el mercado laboral</strong>.</p><p>Jefes de empresas buscan <strong>personal calificado</strong> que realicen trabajos eficiente- y productivamente.</p><p>Tus clientes te apreciarán por <em>crear reportes más llamativos y visuales.</em></p><p>Estarás <strong>por delante de tus colegas</strong> si dominas Excel.</p><p>Esta formacion hará <em>crecer tu nivel de confianza</em> con Excel.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;_____________________________________</p><p><strong>ES&nbsp;SÓLO&nbsp;PARA&nbsp;PRINCIPIANTES?</strong></p><p>Este curso está diseñado para el usuario que quiere <strong>iniciarse en Excel </strong>o para aquel que ya tiene <strong>conocimiento moderado</strong> y busca un curso estructurado, divertido, organizado y sobre todo práctico.</p><p>Los usuarios más experimentados podrán igualmente <strong>reforzar conceptos olvidados o descubrir consejos y trucos PRO</strong> que otros cursos no imparten.</p><p>Esta formación es para ti, sin importar el cargo o puesto que tengas:</p><p> Ejecutivos de ventas y cuentas</p><p>- Analistas financieros y contadores</p><p>- Estudiantes que cursan administración de empresas, contabilidad o finanzas.</p><p>- Administradores y asistentes</p><p>- Consultores, Recursos humanos</p><p>- Gerentes y ejecutivos</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;_____________________________________</p><p><strong>QUÉ CONSEGUIRÁS CON&nbsp;LO&nbsp;APRENDIDO?</strong><br>Es momento de <strong>ponerse en la posición de:</strong></p><p>- Ganar reconocimiento en el trabajo&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; - Tener seguridad laboral</p><p>- Negociar un mejor salario&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;- Ganar más dinero</p><p>- Pasar más tiempo con tus seres queridos.</p>", "preview_video": ""}, {"course_id": "4592370", "category": "IT & Software", "sub_category": "IT Certifications", "title": "CRISC Certify Risk Information System Control Test + Expl", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "0.0", "reviews": "0", "students": "1618", "coupon_code": "35382BC6DA7A16F495AF", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/crisc-certify-risk-information-system-control-practice-test/?couponCode=35382BC6DA7A16F495AF", "end_day": "2022-03-28 19:00:00+00:00", "headline": "CRISC Certify Risk Information System Control Practice Test 2022 [New] + Explanation", "description": "<p><strong>Description</strong></p><p><br></p><p>The CRISC exam certification is ideal for professional individuals to build a career in IT Risk management, The CRISC exam verifies your ability, knowledge capacity and proven skills.</p><p>The ISACA CRISC certification is mainly targeted to those candidates who want to build their career in IT Risk management domain. The ISACA Certified in Risk and Information Systems Control (CRISC) exam verifies that the candidate possesses the fundamental knowledge and proven skills in the area of ISACA Risk and Information Systems Control.</p><p><strong>Exam Name</strong>: ISACA Certified in Risk and Information Systems Control (CRISC)</p><p><strong>Duration:</strong> 260 mins</p><p><strong>Passing score:</strong> 450/800</p><p><br></p><p><strong>Topics:</strong></p><ul><li><p>IT Risk Identification</p><p>Analyze and evaluate IT risk</p></li><li><p>IT Risk Assessment</p></li><li><p>Risk Response and Mitigation</p></li><li><p>Risk and Control Monitoring and Reporting</p><p>define and establish key risk indicators in order to monitor risk changes</p></li></ul><p><strong>Exam Details:</strong></p><ul><li><p><strong>Exam Name : </strong>CRISC Certify Risk Information System Control Practice Exam</p></li><li><p><strong>Total Questions : 393</strong></p></li><li><p><strong>Type of Questions : Multiple choice</strong></p></li><li><p><strong>Time Allowed :260 mins</strong></p></li><li><p><strong>Passing Score : 75 </strong></p></li></ul><p><br></p><p><strong>Who this course is for:</strong></p><p><br></p><ul><li><p>all those candidates who are planning of taking CRISC exam </p></li><li><p>Anyone who wants to pass CRISC certification exam</p><p><br></p></li></ul><p><br></p><p><strong>What are the requirements or prerequisites for taking your course?</strong></p><p>There are no prerequisite requirements for taking the CRISC the CRISC exam:</p><p>• &gt;1 year of work experience managing IT risk by designing and implementing IS controls...</p><p>• There are no substitutions or experience waivers</p><p>• Basic Knowledge </p><p><br></p>", "preview_video": ""}, {"course_id": "4335680", "category": "Teaching & Academics", "sub_category": "Other Teaching & Academics", "title": "practical bacteriology from scratch", "level": "All Levels", "author": "Mohamed AL ashram", "duration": "null", "rating": "4.1", "reviews": "21", "students": "3751", "coupon_code": "6F873FD10FA74D4D1D5A", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/practical-bacteriology-from-scratch/?couponCode=6F873FD10FA74D4D1D5A", "end_day": "2022-03-28 04:13:00+00:00", "headline": "you  should know what will you do in lab", "description": "<p>practical bacteriology from scratch&nbsp; </p><p>your safety first&nbsp; &nbsp;take care when working with pathogenic microorganisms wear coat&nbsp; when you are in lab and remove after finish keep the lab disk for equipment only wear gloves when dealing with microorganisms clean&nbsp; clean&nbsp; table before and after test mask eye protect&nbsp; keep your hand away from mouth and eye and nose&nbsp; use mechanical pipetting report the spill and disinfect the area well&nbsp; wash hands after any procedure deal well with fire smooth small one with towel large one use expenditure follow the instructions included in lab safety manual be professional in handling microscope&nbsp; there are many types with many uses bright field microscope&nbsp; dark field microscope phase contrast microscope fluorescent microscope electro microscope&nbsp; it is essential tool practice using the microscope with low power medium power&nbsp; high power and take care when use oil immersion lens sterilization the most important topic in microbiology&nbsp; without keeping your environment sterile it is impossible to obtain Apure culture&nbsp; sterilization methods heat sterilization&nbsp; sterilization by radiation sterilization by disinfectant chemicals&nbsp; &nbsp;use of antimicrobial bacterial culture is a&nbsp; method for isolate bacteria the culture may be natural in origin or synthetic or both culture may be ordinary enriched&nbsp; &nbsp; &nbsp; blood agar is enriched media They contain substances Blood ,Serum. Extract of plants or animal tissues that enhance growth of bacteria&nbsp; &nbsp;Heated blood agar chocolate agar ▪ heated blood agar chocolate agar heating blood ▪ in water path at 75c for 10 minutes ▪ Until blood become chocolate brown in color&nbsp; &nbsp; &nbsp; differential or specific&nbsp; and see it in colonies which in appearance characteristic after culture we need to sea the bacterial cell clearly stain&nbsp; our tool to change the background and sea bacterial morphology and enhance the contrast we sea details&nbsp; differential or structural preparing the smear and fix on Bunsen flame&nbsp; &nbsp;simple stain like methylene blue crystal violet negative staining is simplest method&nbsp; &nbsp;differential stain differentiate the bacteria into two groups&nbsp; like gram stain differentiate bacteria into gram +ve gram -ve&nbsp; it is invented by hans gram he use methylene blue as basic stain iodine as&nbsp; &nbsp;bacteria are not decolorized and remain violet after decolorization carbol fuchsine a red counter stain is used to impart a pink color to the decolorized gram negative organisms The acid fast stain is a different stain in 1882 Paul Ehrlich discovered mycobacterium tuberculosis the causative agent of tuberculosis retained the primary stain even after washing with an acid alcohol mixture most bacteria are decolorized by acid alcohol only family mycobacteriacae and nocardiacea The cell wall of acid fast contain wax like lipid called mycolic acid render the cell impermeable to most stain technique developed by franz zeil and fredrch neelsen capsule stain Some bacteria are surrounded by slimy layer called capsule some glycoprotein some polypeptide all appear water soluble heat fixed smear destroy the capsule if not fixed slide from slide combine negative and simple staining species of bacteria related to genera bacillus or clostridium produce heat resistant structure called spores resistance to chemicals and heat due to thick tough spore coat&nbsp; Schaeffer- Fulton methods utilize malachite green to stain the endospores and safranin or carbol fuchsin to stain the vegetative portion of the cell green spore contained in pink vegetative bacilli&nbsp; </p><p> bacteria to continue its life and defend herself produce enzymes like oxidases catalase coagulase we use these enzyme in identifying every bacteria biochemical test are designed for this purpose step by step you can be bacteriologist&nbsp; just keep going</p>", "preview_video": ""}, {"course_id": "3889976", "category": "Business", "sub_category": "Entrepreneurship", "title": "Money In Excel - Income Tax Sch. C & Personal Financials", "level": "All Levels", "author": "Robert (Bob) Steele", "duration": "null", "rating": "4.7", "reviews": "91", "students": "35240", "coupon_code": "C5FC179AFC343002D781", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/money-in-excel-income-tax-sch-c-personal-financials/?couponCode=C5FC179AFC343002D781", "end_day": "2022-03-27 04:16:00+00:00", "headline": "Learn how Money in Excel can be used to create financial reports and complement traditional accounting software like QBO", "description": "<p>Money in Excel is an Excel template provided by Microsoft that has bank connectivity similar to many accounting software applications such a QuickBooks, bank connectivity allowing for the download of financial data directly from the financial institutions.</p><p>Money in Excel can be used to construct a small business income statement which could be useful when preparing an income tax return Schedule C Profit or Loss From Business.</p><p>The Money in Excel template can also be used to complement accounting software such as QuickBooks. For example, many small businesses use accounting software like QuickBooks to record financial transactions and construct financial statements for their business. However, far fewer use financial accounting software to fulfill the same functions for their individual finances, a task that may be accomplished with Money in Excel.</p><p>Unlike financial accounting software, Money in Excel will also bring in balance sheet data directly from our financial institutions and put it in one location, balance sheet data like checking accounting balances, savings accounting balances, brokerage account balances, credit card balances, loan balances, and mortgage balances.</p><p>Accounting software like QuickBooks does not generally pull balance sheet balances directly from financial institutions because accounting software is designed to construct the ending balances using the double entry accounting system. Once the balance sheet balances have been constructed traditional accounting software will compare our book balance to the institution balance using tools such as bank reconciliations.</p><p>This course will cover how to access the Money in Excel template and connect it to financial institutions, downloading financial data.</p><p>We will work through a practice problem, imagining we are a small business wanting to construct an income statement needed for our income tax preparation at year end, income tax reported on a Schedule C Profit or Loss From Business Form. As we work the practice problem, we will compare the process to what may be done using traditional accounting software like QuickBooks.</p><p>We will then investigate construction of a personal balance sheet using Money in Excel, comparing how the process may be done using traditional accounting software.</p><p>The course will also cover other functions provided by Money in Excel including budgeting options and recurring transactions.</p>", "preview_video": ""}, {"course_id": "2870128", "category": "Office Productivity", "sub_category": "Other Office Productivity", "title": "QuickBooks Online Not for Profit Organization", "level": "All Levels", "author": "Robert (Bob) Steele", "duration": "null", "rating": "4.3", "reviews": "49", "students": "16482", "coupon_code": "1A4CD13A73770EEEB29D", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/quickbooks-online-not-for-profit-organization/?couponCode=1A4CD13A73770EEEB29D", "end_day": "2022-03-27 04:27:00+00:00", "headline": "Learn Not for Profit accounting using QuickBooks Online from a practicing CPA", "description": "<p>Learners will understand how to set up QuickBooks Online for a Not for Profit Organization.</p><p>The course will show how to use free resources to optimize learning.</p><p>We will demonstrate the use of class tracking to generate Not for Profit reports.</p><p>Learners will see how to create and use donation receipt forms.</p><p>We will show how to create and use pledge receipt forms.</p><p>The course will demonstrate how to enter and track restricted resources.</p><p>We will enter month end adjusting entries.</p><p>Learners will see how to allocate expenses to programs and administrative categories.</p><p>We will record net assets released from restriction.</p><p>The course will show how to generate, analyze, memorize, &amp; export to Excel financial reports.</p>", "preview_video": ""}, {"course_id": "4606372", "category": "IT & Software", "sub_category": "IT Certifications", "title": "ITILFND V4: ITIL 4 Foundation Practice Tests 2022", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "0.0", "reviews": "0", "students": "1164", "coupon_code": "8D082177737E23727AB9", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/itilfnd-v4-itil-4-foundation-practice-tests-2022/?couponCode=8D082177737E23727AB9", "end_day": "2022-03-28 18:57:00+00:00", "headline": "ITILFND V4: ITIL 4 Foundation Practice Tests 2022 [New]", "description": "<p><strong>Description</strong></p><p><br></p><p>What is ITIL? </p><p>ITIL best practices now have their place in IT organizations. With ITIL: IT is aligned with the company's business lines, customer satisfaction is improved, costs are reduced in the long term, quality is continuously improved, and returns on investment are measurable.</p><p><br>Why get certified ITIL Foundation? The ITIL Foundation level proves to organizations in which the participant would like to participate his knowledge in the concrete application of the bases of ITIL Practices. This ITIL Foundation certification also opens the door to the ITIL Expert certification cycle. At the end of this training, participants take the ITIL Foundation certification exam</p><p>pass the ITIL 4 Foundation exam you must know the theory very well but also have high level hands-on skills. The element most students forget it drilling their knowledge with a ton of practice exams. Practice exams help you learn to apply theory to questions as well as expose weak areas in your knowledge.</p><p><br></p><p><strong><em>Topics</em>:</strong></p><p><br></p><ul><li><p>Understand the key concepts of service management</p></li><li><p>Understand how the ITIL guiding principles can help an organization adopt and adapt service management</p></li><li><p>Understand the four dimensions of service management</p></li><li><p>Understand the purpose and components of the ITIL service value system</p></li><li><p>Understand the activities of the service value chain, and how they interconnect</p></li><li><p>Understand 7 ITIL practices</p></li></ul><p><br></p><p><br></p><p><strong>We have covered all these knowledge areas in our simulated exams, good luck with your exam!!</strong></p><p>You can be able to see which answers were correct and which were not by clicking on \"Review Questions\" button when you complete or end the practice tests.</p><p><br></p><p><strong>good luck!!!</strong></p><p><br></p>", "preview_video": ""}, {"course_id": "3904774", "category": "Business", "sub_category": "Human Resources", "title": "Diversity At Workplace", "level": "All Levels", "author": "Nevcihan Dogan", "duration": "null", "rating": "4.3", "reviews": "229", "students": "31581", "coupon_code": "MARCH.2022", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/diversity-at-workplace-t/?couponCode=MARCH.2022", "end_day": "2022-03-28 14:33:00+00:00", "headline": "If you want to position your business for success, hire a diverse workforce.", "description": "<p><strong>Diversity in the workplace</strong> is vital for employees because it manifests itself in building a great reputation for the company, leading to increased profitability and opportunities for workers.</p><p>Workplace diversity is important within the organization as well as outside.</p><p><strong>Diversity in the workplace</strong> means that a company’s workforce includes people of varying gender, age, religion, race, ethnicity, cultural background, sexual orientation, religion, languages, education, abilities, etc.</p><p><strong>Why is workplace diversity so important?</strong></p><p>In the modern, globally connected society and market, workplace diversity is becoming a <strong>necessity </strong>rather than a banner companies wave to show their commitment to embracing differences.</p><p>Most of the modern companies can sell their products <strong>all over the world</strong>, reaching many different groups of people. In order to successfully create, present and sell their products in this global market, companies <strong>need </strong>a diversified workforce.</p><p>So, in this class our Learning Objectives are:</p><ul><li><p>Understand what diversity and its related terms mean</p></li><li><p>Be able to identify your stereotypes</p></li><li><p>Understand what terms are politically correct and which are not, and why</p></li><li><p>Be familiar with the four cornerstones of diversity</p></li><li><p>Develop a technique for dealing with inappropriate behavior</p></li><li><p>Develop a management style to encourage diversity</p></li><li><p>Know what to do if you or one of your employees feels discriminated against</p></li></ul><p>So, shall we get started? I wish you a happy learning!</p>", "preview_video": ""}, {"course_id": "4511778", "category": "Business", "sub_category": "Project Management", "title": "The Comprehensive Course in Construction Project Management", "level": "All Levels", "author": "Abdulkareem Bilal", "duration": "null", "rating": "4.5", "reviews": "45", "students": "4456", "coupon_code": "FREE12", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/the-comprehensive-course-in-construction-project-management/?couponCode=FREE12", "end_day": "2022-03-27 21:27:00+00:00", "headline": "This course is ideal for developing your understanding and skills in professionally managing all construction projects", "description": "<p><strong>Construction Project Management </strong>introduces you to project initiation and planning. This professional course will provide an overview of the construction industry and all related topics that you need to be qualified project manager,</p><p>Engineer Abdulkareem, teaches the fundamentals of the construction project cycle from the initiation phase till the closure of the project phase. The course discussing the importance of project planning and scheduling and an opportunity to develop a work breakdown structure. This course designed to expand your practical side of engineering knowledge. This course concentrating on the practical side of the construction field.</p><p>You will see samples of different contract documents, and you will know the types of these documents and their importance. The course will discuss other important topics, such as how to find the critical path method \"CPM\", complete knowledge of quality assurance and quality control and much more, which is essential for all construction projects.</p><p>Gain confidence when dealing with stakeholders of major projects by learning to identify and manage those that are involved in the project planning and delivery, and will enable you to explore construction projects governance in theory and practice. You will Learn how to manage successfully the project budget and delivering the project on time. </p><p>This course is designed for anyone involved in project management and interested in developing their management capabilities and knowledge about quality, risk and safety management.</p>", "preview_video": ""}, {"course_id": "3434032", "category": "IT & Software", "sub_category": "IT Certifications", "title": "Python Complete Course For Python Beginners", "level": "Beginner Level", "author": "Horizon Tech", "duration": "null", "rating": "4.0", "reviews": "2411", "students": "217440", "coupon_code": "7FCDBB2C95897FFAE246", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/python-complete-course-for-beginners/?couponCode=7FCDBB2C95897FFAE246", "end_day": "2022-03-29 01:29:00+00:00", "headline": "Python Complete Course For Python Beginners.Learn Python From Beginner To Advanced Level", "description": "<p><strong><em>Learn Python From Beginner To Advanced Level</em></strong></p><ul><li><p> I’ve created thorough, extensive, but easy to follow content which you’ll easily understand and absorb.</p><p> The course starts with the basics, including Python fundamentals, programming, and user interaction.</p><p><br></p><p>The curriculum is going to be very hands-on as we walk you from start to finish becoming a professional Python developer. We will start from the very beginning by teaching you Python basics and programming fundamentals, and then going into advanced topics and different career fields in Python so you can get real-life practice and be ready for the real world.</p></li></ul><p><br></p><ul><li><p>The topics covered in this course are:</p><p><strong><em>* Beginner to Expert Python contents:</em></strong></p><p><br></p><p><strong>Array implementation</strong></p><p><strong>File methods</strong></p><p><strong>Keywords and Identifiers</strong></p><p><strong>Python Tuples</strong></p><p><strong>Python Basics</strong></p><p><strong>Python Fundamentals</strong></p><p><strong>Data Structures</strong></p><p><strong>Object-Oriented Programming with Python</strong></p><p><strong>Functional Programming with Python</strong></p><p><strong>Lambdas</strong></p><p><strong>Decorators</strong></p><p><strong>Generators</strong></p><p><strong>Testing in Python</strong></p><p><strong>Debugging</strong></p><p><strong>Error Handling</strong></p><p><strong>Regular Expressions</strong></p><p><strong>Comprehensions</strong></p><p><strong>Modules</strong></p></li><li><p><strong>See you inside the course!</strong></p></li></ul>", "preview_video": ""}, {"course_id": "4458742", "category": "Teaching & Academics", "sub_category": "Engineering", "title": "IEEE 1584-2018 | Guide for Performing Arc Flash Calculations", "level": "All Levels", "author": "Abdur Rehman", "duration": "null", "rating": "5.0", "reviews": "4", "students": "746", "coupon_code": "IEEE-1584-2018", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/ieee-1584-2018-guide-for-performing-arc-flash-calculations/?couponCode=IEEE-1584-2018", "end_day": "2022-03-28 16:08:00+00:00", "headline": "Guide for Performing Arc Flash Calculations", "description": "<p>Welcome, Everyone!</p><p><br></p><p>This is Abdur from AllumiaX Engineering headquartered in Seattle, Washington. We do power systems engineering for industrial commercial customers. And in this technical course, we're going to talk about the IEEE-1584 2018 published standard. It is the guide for performing arc flash hazard calculations. And I want to walk you through some of the things that we're going to cover in this technical course. So, let's get started.<br></p><p>In this course, we're going to talk about the introduction (what's the need for this IEEE-1584 standard). We're going to talk about the history and go over the IEEE 1584-2002 version up to the 2018 version. And there are the 16 years of rich history that's extremely important to understand where we are today with the 2018 version and some of the changes.<br><br>Furthermore, we're going to talk about a lot of different changes in the IEEE-1584 2018 standard. There are different busbar electrode combinations, there's a different voltage range and conductor gap information, there's information about the box, the height, the width, and the depth, and how they use that enclosure box to calculate the instant energy levels. There's the arcing current variation corrective factor that goes into a lot of detail, there is arc flash test, the continuous voltage spectrum, the enclosure size and correction factor, the table of equipment and class types, the minimum arcing current adjustments, and the 125 kVA transformer cutoff whatever happened to that, so we'll talk about that as well. Grounded versus ungrounded systems, the two-second rule cut off where that is, and as well as what's next? what goes above and beyond this 2018 standard?<br><br>So, stick around you'll expect to learn a lot from this standard and from this course. And we hope to see you on the other side.<br><br>Thank you.</p>", "preview_video": ""}, {"course_id": "4589834", "category": "IT & Software", "sub_category": "IT Certifications", "title": "Oracle PL/SQL 1Z0-148 Certification - Practice Tests", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "5.0", "reviews": "2", "students": "2113", "coupon_code": "079264E49E59DAF1BB26", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/oracle-plsql-1z0-148-certification-practice-tests/?couponCode=079264E49E59DAF1BB26", "end_day": "2022-03-28 18:53:00+00:00", "headline": "[New] Oracle PL/SQL 1Z0-148 Certification - Practice Tests 2022", "description": "<p><strong>Description</strong></p><p>The Oracle 1Z0-148 certification exam contains 75 multiple-choice questions which individuals have 110 minutes to answer. You must receive a score of 62% or higher in order to pass.</p><p>With this practice test you will only get the exam practice questions , No course needed. These tests are simulations of what the real exam will be like.</p><p><br></p><p><strong>Benifits</strong></p><p>By becoming an Oracle Database PL/SQL Certified Professional, you will be ready to fully exploit the most advanced features of PL/SQL. From performance to maintainability to application code architecture, you will be able to provide guidance at a more strategic level, thereby offering much higher value to your company and the marketplace.</p><p>You will gain thorough knowledge of PL/SQL language, its architecture, features, interactions with the SQL engine, programming constructs and datatypes. Passing the exam validates your knowledge of subjects such as complex datatypes, dynamic cursors, external procedures, security features and considerations, and performance related features such as caching, parallel execution and profiling.</p><p>Prove fluency in and a solid understanding of the skills required to fully leverage PL/SQL as part of the foundation of any application built on top of Oracle Database.</p><p><br></p><p><strong>Topics</strong></p><p>Exam Name : <strong>Oracle Database: Advanced PL/SQL.</strong></p><p>Exam Code : 1Z0-148</p><p>Exam Level : Associate</p><p>Duration : 110 mins</p><p>Number of Questions : 75</p><p>Passing Score : 62%</p><p>Format : Multiple Choice</p><p><br></p>", "preview_video": ""}, {"course_id": "4474784", "category": "Development", "sub_category": "No-Code Development", "title": "Wie man Wordpress installiert und eine Landing Page erstellt", "level": "Beginner Level", "author": "Sebastian Glöckner", "duration": "null", "rating": "0.0", "reviews": "0", "students": "495", "coupon_code": "C8F201C9B698B64E5D6B", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/landingpage-wordpress/?couponCode=C8F201C9B698B64E5D6B", "end_day": "2022-03-28 14:15:00+00:00", "headline": "Eine Schritt-für-Schritt-Anleitung für alle Online-Marketer und Unternehmer", "description": "<p>Deine erste <strong>erfolgreiche Landingpage mit Wordpress</strong> erstellen</p><p>Du willst mehr Kunden, mehr Conversion und mehr Umsatz?</p><p>Deine <strong>erfolgreiche Landingpage</strong> ist der Schlüssel.<br></p><p>In diesem Kurs wirst du lernen, wie du <strong>deine erste Landingpage erstellst</strong> und Sie mit dem <strong>richtigen Hoster zum Leadmagneten</strong> machst.</p><p> Dieser Kurs hilft dir, deine Website <strong>ganz einfach und ohne Programmierkenntnisse</strong> zu erstellen.</p><p>Wir gehen alles von A bis Z deiner Landingpage durch, damit du jeden Tag mehr Leads gewinnst und mehr Umsatz machst.<br><br>Wenn das Internet eine Einkaufsstraße ist, dann ist deine Landingpage dein Schaufenster. Sie entscheidet jeden Tag, <strong>ob ein Kunde kauft oder nicht</strong> kauft.</p><p>Deswegen werden wir in diesem Kurs dein Fundament für deine Landingpage gießen und Abschnitt für Abschnitt dein Wissen und deine Fähigkeiten erweitern.</p><p>Der Kurs enthält alles, was du brauchst, um eine <strong>erfolgreiche Landing Page</strong> zu erstellen, auf die du stolz sein kannst:</p><p>Wenn du die Schritte in diesem Kurs befolgst, wirst du lernen, dank einer <strong>attraktiven und verlockenden Landing Page</strong> einen effektiven Leadmagneten zu erstellen. Denn: wenn dein Produkt gut ist, aber nicht online angeboten wird, <strong>wird der Kunde nie wissen, dass es existiert</strong>.</p><p>Von der Einrichtung deiner Landing Page über die <strong>Suche nach dem richtigen Hoster</strong> bis hin zur Erstellung eines Lead-Magneten - dieser Minikurs gibt dir alles an die Hand. </p><p>Die Erstellung einer <strong>stilvollen und profitablen Landing Page </strong>kann einfacher sein, als du denkst!</p><p><br></p>", "preview_video": ""}, {"course_id": "3735538", "category": "Personal Development", "sub_category": "Personal Transformation", "title": "Self-Discipline: Build Habits & Develop a Growth Mindset", "level": "All Levels", "author": "Claudia Simonetto", "duration": "null", "rating": "4.5", "reviews": "384", "students": "47709", "coupon_code": "16CF2818DD7D672DD0DD", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/self-discipline-build-habits/?couponCode=16CF2818DD7D672DD0DD", "end_day": "2022-03-27 15:28:00+00:00", "headline": "Master Self-Discipline, Stop Procrastinating & Develop Daily Habits Of Success For Achieving Your Goals", "description": "<p>Join our students who have taken our time management, goal setting and focus mastery courses with great results!</p><p>This course will teach you why and how to develop self-discipline, increase your motivation and stop procrastinating, empowering you to build daily habits for long-term success.</p><p>Whether you are a student, employee or entrepreneur, you will need to get your job done and, possibly, do it in the best possible way.</p><p>In fact, we have all faced the frustration of a job we don't like or a task we find difficult to complete, or a passion we have to fight for.</p><p>Days spent on the couch instead of working on our goals, evenings wasted watching TV instead of improving ourselves and excuses to postpone important commitments.</p><p><em>Are You a Victim of Yourself?</em></p><p><strong>The key to success is to grow your self-discipline.</strong></p><p>This course is about improving your ability to learn how to build self-discipline, break bad habits, and achieve your goals so that you can live the life you've always dreamed of.</p><p><strong>The core of this Self-Discipline course involves 3 main aspects:</strong></p><ul><li><p>Developing a growth mindset and mental toughness to become the person you really want to be.</p></li><li><p>Beating procrastination by eliminating its root causes and finishing what you start, always.</p></li><li><p>(30 Days of Change Program) Building good habits for personal growth to create a life based on your goals.</p></li></ul><p>We also give you advanced proven methods to gain self-discipline and increase your motivation to work on your goals and take control of your habits and choices.</p><p>The powerful ways to master self-discipline you'll learn in this course are applicable to many aspects of your every day life, from working on a project to acquiring new skills.</p><p><strong>How this Self-Discipline course will improve your life and double your motivation:</strong></p><p>Most people think that their goals cannot be achieved due to bad luck, lack of time or insufficient financial resources.</p><p>Wrong.</p><p><strong>The most common barrier we face while trying to achieve our goals is ourselves.</strong></p><p>The foundational attribute all successful people share is self-discipline.</p><p><em>“People who lack self-discipline are often the victims of those who do have self-discipline.”</em></p><p>The combination of mental toughness, motivation and the development of the right habits, are an effective and foolproof method to stop procrastinating and reach your goals. But all this is possible exclusively by developing self-discipline.</p><p><strong>This self-discipline course is the foundation of personal development.</strong></p><p>There is no goal setting, time management, focus mastery, career development or management skills without the solid foundation of self-discipline.</p><p>It won't be easy, but if you turn theory into practice, success is guaranteed!</p>", "preview_video": ""}, {"course_id": "3707538", "category": "Design", "sub_category": "Architectural Design", "title": "تعلم رسم ملامس الخامات بالماركر", "level": "All Levels", "author": "Dr/ Mohamed Mohamed Azmy", "duration": "null", "rating": "5.0", "reviews": "4", "students": "982", "coupon_code": "F92A977E27DE9FACE3FF", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/rendering-materials-with-marker/?couponCode=F92A977E27DE9FACE3FF", "end_day": "2022-03-28 12:08:00+00:00", "headline": "طريقك لرسم ملامس الخامات بشكل احترافي خطوة بخطوة من الصفر", "description": "<p dir=\"rtl\">أهلا بكم في دورة \"اظهار ملامس الخامات بالماركر\". حرصت في هذه الدورة أن تبدأ من المستوي صفر وذلك لما تحتويه الدورة من رسم واظهار ملامس الخامات المختلفة الداخلية والخارجية للفراغات الداخلية والخارجية المباني المعمارية حيث انها من الأشياء الهامة جدا في خيال كل متخصص في الدراسة كأقسام العمارة أو التصميم الداخلي. وثانيا هي ألوان الماركر، حيث انها اصبحت ذات أهمية كبيرة بالفترة الأخيرة وقدرتها على التعبير بجرأة لرسم هذه التفاصيل والملامس سواء داخلية او خارجية.</p><p dir=\"rtl\">كان هدفي بهذه الدورة عدم الاحساس بالهيبة والخوف من التعامل مع ألوان الماركر، والتعامل معها بناء على تكنيك مبسط وسهل، ولهذا قمت برسم أكثر عدد من ملامس الخامات (الداخلية والخارجية) المتداولة لتعليم اظهار ملامس الخامات بألوان الماركر خطوة بخطوة للمبتدئين، وذلك برسم منفرد لكل خامة على حده حيث التركيز على التفاصيل الخاصة بكل خامة حتى تصل الي رسمها باحتراف بإذن الله، مع الأخذ في الاعتبار تأثير الإضاءة عليها من مناطق مضاءة واخري مظللة، مع ذكر الأخطاء الشائعة اثناء عملية الرسم. وذلك لكي تكون عونا لطلاب العمارة والتصميم الداخلي والفنون الجميلة ومن يهتم ويتفاعل مع هذا النوع من المواضيع المتخصصة سواء في المحتوى المقدم او طريقة التلوين بألوان الماركر.</p><p dir=\"rtl\">ولذلك حاولت قدر المستطاع تجميع أكثر عدد من الملامس للخامات المعروفة في هذه الدورة متمنيا من الله ان تصل الي هدفك في مستوى الاحتراف في هذا المجال.</p>", "preview_video": ""}, {"course_id": "4412242", "category": "IT & Software", "sub_category": "Operating Systems & Servers", "title": "Windows Server 2022  OS  Administration For Freshers", "level": "Beginner Level", "author": "Mohammed Asif Khan", "duration": "null", "rating": "3.7", "reviews": "36", "students": "7762", "coupon_code": "WE-ARE-FRESHERS", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/learn-windows-server-2022-in-an-easy-way-basics-to-advanced/?couponCode=WE-ARE-FRESHERS", "end_day": "2022-03-28 17:44:00+00:00", "headline": "System Administration  Windows Server 2022  For Freshers : Ultimate  Course With Practical Examples & Hands-on Training", "description": "<p>This Course is primarily&nbsp; designed for<strong><em> freshers</em></strong> who want to start the career in <strong>System and Network Administration.&nbsp; </strong></p><p><br></p><p>The &nbsp;Windows Server 2022 Operating System administration Course is designed from basic to advanced level in an easy way.</p><p><br></p><p>After completing it you will be a System Administrator ( Level 2 Administrator) and you can manage Windows Server Operating Systems like<em> Windows Server 2022, Windows Server 2019, Windows Server 2016 and Windows Server 2012.</em></p><p><br></p><p>Testimonials: </p><p>\"This course is very helpful for me as i was searching for videos to update my knowledge.Well Explained, Thank You\" <em>-Mohd A.</em></p><p><br></p><p> \" One of the best lecturers. He used to present the lectures very nicely and the way of conducting classes was impressive. Very knowledgeable and cooperative . He is good at explaining in a very understandable way. The notes provided are precise. He is always reachable even after the class /course and eager to help if there is any doubt\" -<em> Sharmin Akhter</em></p><p><br></p><p> \"I have been trained CCNA course by Mohammed. He has the ability to explain complex concepts in a simple and understandable way. Admired by his technique when performing Practical Labs and Troubleshooting the issues. I will look forward to learn more from him in future \"- <em>Ramesh S</em></p><p><br></p><p><em>This course is recommended for the students who want to do the advanced courses like</em></p><ul><li><p>Routing and Switching</p></li><li><p>IP Telephony</p></li><li><p>Data-center</p></li><li><p>Service Provider</p></li><li><p>Network Security</p></li><li><p>Wireless</p></li><li><p>Virtualization</p></li><li><p>Cloud Computing etc.</p></li></ul><p><br></p><p>From small to fortune 500 companies are using Microsoft Products which required Windows Operating System (OS)</p><ul><li><p>Windows client Operating System (e.g Windows 10 OS) has captured the market around 76.56 %</p></li><li><p>Windows Server Operating System (e.g Windows Server 2022 OS) has captured the market around 30 - 50 %</p></li><li><p>So, jobs opportunities are huge but the skills are a must.</p></li></ul><p><br></p><p><em>TOPICS:</em></p><ul><li><p>What is Computer?</p></li><li><p>Computer Generations.</p></li><li><p>Computer Components.</p></li><li><p>What is Network and Networking?</p></li><li><p>Network Devices and their functionalities.</p></li><li><p>What is Operating System?</p></li><li><p>Windows Server 2022 Installation</p></li><li><p>Windows 10 Installation</p></li><li><p>IP Addressing</p></li><li><p>Physical and Logical topologies</p></li><li><p>Active Directory</p></li><li><p>Domain Controller</p></li><li><p>Joining clients to the domain</p></li><li><p>User Management</p></li><li><p>Editing Default Password Policy</p></li><li><p>Account Lockout Policy</p></li><li><p>Restricting Users</p></li><li><p>Groups</p></li><li><p>Giving Administrator Rights To Users</p></li><li><p>Partition</p></li><li><p>Security Level Permission</p></li><li><p>Share Level Permission</p></li><li><p>Local Profile</p></li><li><p>Roaming Profile</p></li><li><p>Home Folder</p></li><li><p>FSRM</p></li><li><p>Organization Unit</p></li><li><p>Delegation</p></li><li><p>Additional Domain Controller</p></li><li><p>Tree</p></li><li><p>Forest</p></li><li><p>Active Directory Roles</p></li><li><p>Transfer Of Roles</p></li><li><p>Seize Of Roles</p></li><li><p>Group Policy</p></li><li><p>OU Level Group Policy</p></li><li><p>Domain-Level Group Policy</p></li><li><p>Site Level Group Policy</p></li><li><p>Group Policy Modeling</p></li><li><p>Group Policy Backup and Recovery</p></li><li><p>Applying Scripts Using Group Policy</p></li><li><p>Trust and Its Types</p></li><li><p>Active Directory Partitions</p></li><li><p>Global Catalog</p></li><li><p>Sites</p></li><li><p>DHCP</p></li><li><p>DNS</p></li><li><p>IIS</p></li><li><p>Remote Desktop Service</p></li><li><p>Remote Access Service</p></li><li><p>FTP etc.</p></li></ul><p><br></p><p><br></p><p><br></p>", "preview_video": ""}, {"course_id": "4571598", "category": "IT & Software", "sub_category": "IT Certifications", "title": "Microsoft Azure Fundamentals AZ-900 : Practice Exams", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "4.8", "reviews": "7", "students": "3158", "coupon_code": "DF2DFC83D75D93447CED", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/microsoft-azure-fundamentals-az-900-practice-exams-m/?couponCode=DF2DFC83D75D93447CED", "end_day": "2022-03-28 18:56:00+00:00", "headline": "[NEW] Microsoft Azure Fundamentals AZ-900 - Practice Test 2022", "description": "<p><strong>Description</strong></p><p><strong>Exam AZ-900:</strong> Microsoft Azure Fundamentals checks and validates your fundamental knowledge of cloud services and how Microsoft Azure provides the cloud services, irrespective of any specific role.</p><p><strong>Topics:</strong></p><p><strong>**Describe Cloud Concepts </strong></p><p>Identify the benefits and considerations of using cloud services</p><p>- identify the benefits of cloud computing, such as High Availability, Scalability, Elasticity, Agility, and Disaster Recovery<br>- identify the differences between Capital Expenditure (CapEx) and Operational Expenditure (OpEx)<br>- describe the consumption-based model</p><p>Describe the differences between categories of cloud services</p><p>- describe the shared responsibility model<br>- describe Infrastructure-as-a-Service (IaaS)<br>- describe Platform-as-a-Service (PaaS)<br>- describe serverless computing<br>- describe Software-as-a-Service (SaaS)<br>- identify a service type based on a use case</p><p>Describe the differences between types of cloud computing</p><p>- define cloud computing<br>- describe Public cloud<br>- describe Private cloud<br>- describe Hybrid cloud<br>- compare and contrast the three types of cloud computing</p><p><strong>**Describe Core Azure Services </strong></p><p>Describe the core Azure architectural components</p><p>- describe the benefits and usage of Regions and Region Pairs<br>- describe the benefits and usage of Availability Zones<br>- describe the benefits and usage of Resource Groups<br>- describe the benefits and usage of Subscriptions<br>- describe the benefits and usage of Management Groups<br>- describe the benefits and usage of Azure Resource Manager<br>- explain Azure resources</p><p>Describe core resources available in Azure</p><p>- describe the benefits and usage of Virtual Machines, Azure App Services, Azure Container Instances (ACI), Azure Kubernetes Service (AKS), and Azure Virtual Desktop<br>- describe the benefits and usage of Virtual Networks, VPN Gateway, Virtual Network peering, and ExpressRoute<br>- describe the benefits and usage of Container (Blob) Storage, Disk Storage, File Storage, and storage tiers<br>- describe the benefits and usage of Cosmos DB, Azure SQL Database, Azure Database for MySQL, Azure Database for PostgreSQL, and SQL Managed Instance<br>- describe the benefits and usage of Azure Marketplace</p><p><strong>**Describe core solutions and management tools on Azure </strong></p><p>Describe core solutions available in Azure</p><p>- describe the benefits and usage of Internet of Things (IoT) Hub, IoT Central, and Azure Sphere<br>- describe the benefits and usage of Azure Synapse Analytics, HDInsight, and Azure Databricks<br>- describe the benefits and usage of Azure Machine Learning, Cognitive Services and Azure Bot Service<br>- describe the benefits and usage of serverless computing solutions that include Azure Functions and Logic Apps<br>- describe the benefits and usage of Azure DevOps, GitHub, GitHub Actions, and Azure DevTest Labs</p><p>Describe Azure management tools</p><p>- describe the functionality and usage of the Azure Portal, Azure PowerShell, Azure CLI, Cloud Shell, and Azure Mobile App<br>- describe the functionality and usage of Azure Advisor<br>- describe the functionality and usage of Azure Resource Manager (ARM) templates<br>- describe the functionality and usage of Azure Monitor<br>- describe the functionality and usage of Azure Service Health</p><p><strong>**Describe general security and network security features </strong></p><p>Describe Azure security features</p><p>- describe basic features of Azure Security Center, including policy compliance, security alerts, secure score, and resource hygiene<br>- describe the functionality and usage of Key Vault<br>- describe the functionality and usage of Azure Sentinel<br>- describe the functionality and usage of Azure Dedicated Hosts</p><p>Describe Azure network security</p><p>- describe the concept of defense in depth<br>- describe the functionality and usage of Network Security Groups (NSG)<br>- describe the functionality and usage of Azure Firewall<br>- describe the functionality and usage of Azure DDoS protection</p><p><strong>**Describe identity, governance, privacy, and compliance features </strong></p><p>Describe core Azure identity services</p><p>- explain the difference between authentication and authorization<br>- define Azure Active Directory<br>- describe the functionality and usage of Azure Active Directory<br>- describe the functionality and usage of Conditional Access, Multi-Factor Authentication (MFA), and Single Sign-On (SSO)</p><p>Describe Azure governance features</p><p>- describe the functionality and usage of Role-Based Access Control (RBAC)<br>- describe the functionality and usage of resource locks<br>- describe the functionality and usage of tags<br>- describe the functionality and usage of Azure Policy<br>- describe the functionality and usage of Azure Blueprints<br>- describe the Cloud Adoption Framework for Azure</p><p>Describe privacy and compliance resources</p><p>- describe the Microsoft core tenets of Security, Privacy, and Compliance<br>- describe the purpose of the Microsoft Privacy Statement, Online Services Terms (OST) and Data Protection Amendment (DPA)<br>- describe the purpose of the Trust Center<br>- describe the purpose of the Azure compliance documentation<br>- describe the purpose of Azure Sovereign Regions (Azure Government cloud services and Azure China cloud services)</p><p><strong>**Describe Azure cost management and Service Level Agreements </strong></p><p>Describe methods for planning and managing costs</p><p>- identify factors that can affect costs (resource types, services, locations, ingress and egress traffic)<br>- identify factors that can reduce costs (reserved instances, reserved capacity, hybrid use benefit, spot pricing)<br>- describe the functionality and usage of the Pricing calculator and the Total Cost of Ownership (TCO) calculator<br>- describe the functionality and usage of Azure Cost Management</p><p>Describe Azure Service Level Agreements (SLAs) and service lifecycles</p><p>- describe the purpose of an Azure Service Level Agreement (SLA)<br>- identify actions that can impact an SLA (i.e. Availability Zones)<br>- describe the service lifecycle in Azure (Public Preview and General Availability)</p><p><br></p><p><br></p>", "preview_video": ""}, {"course_id": "3997642", "category": "Development", "sub_category": "Programming Languages", "title": "JavaScript for Beginners - The Complete introduction to JS", "level": "All Levels", "author": "Yassin Marco", "duration": "null", "rating": "4.2", "reviews": "1121", "students": "93877", "coupon_code": "AFEF794835BEB61D055A", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/javascript-for-beginners-the-complete-introduction-to-js/?couponCode=AFEF794835BEB61D055A", "end_day": "2022-03-28 15:40:00+00:00", "headline": "Learn all the Basics of JavaScript and create various basic JavaScript programs and applications", "description": "<p>Learning how to properly program in any programming language can be very complicated espescially if you never did any programming before. having the capacity to program in JavaScript is not different. This is why, this course have been created, to helpyou learn, properly program and understand everything you need to know about JavaScript to be able to master this programming language. If you:</p><p>- Need to learn the basics of JavaScript for work</p><p>- Always wanted to create various projects with this programming language</p><p>- Are currently in school and have to understand some Javascript concepts</p><p>- are simply curious about this programming language</p><p>Then you are definely at the right place and will probably love this course and everything that it has to oofer. Indeed, not only you will learn and understand all the basic concepts and everything aroud JavaScript programming&nbsp; but you will have a lot of practice throught out this course. The goal here is that by the end of this course you have a solid and strong understand of how to write your code with Javascript and be able to create your own JavaScript programs and applications. </p><p><strong>The structure of the course</strong></p><p>The way this course have been built, is made to help you understand and learn everything you need to know about Java script. Indeed, you will understand all the basics of this programming language. From the starting point where you are going to learn what to instal and how to do it to write your first basic lines of code to the more advanced part that contains things such as statements, functions and loop and various practical projects, this course has everything you need to start your JavaScript programming journey. Also, this course has been created not only to help you learn JavaScript but to also, help you have a clear understanding of all the basics of this programming language. Also, this course will teach something very important that can be used in any other programming language and it's the programming logic. Indeed, by creating various applications, you will learn to think like a programmer and this can be applied in any other programming language. In other words, if you don't have any programming experience prior to this course, by completing it you will learn the programming logic and this will help succed not only in JavaScript but it's useful in any other programming language.</p><p>Also, this course is built around a very simple but effective logic that is learning by practice. Indeed, this simply means that this course is definely not theoritical even if it contains some classes that present various Javascript concepts. In other words, this course is built on a logic of learning by practice . This means that you will find plenty of exercices all over the course to help you understand and master this programming language to finaly achieve your end goal of learning how to program in JavaScript.</p><p><strong>For who is this course designed</strong></p><p>There is a lot of JavaScript courses that exist all over the internet. But, this course is definely different. Indeed, all the concepts that can be found in this course are simplified to help you understand them more in depth and a lot easier. Also, it's important to mention that each element in this course is presented with a multitude of various programming examples that will allow you to practice everything that you will learn all over the course. In other words, if you never wrote a single line of code or did any programming prior this course and you always wanted to start somewhere then you will probably love this course. The way this course is presented and structured is here to help you achieve your obective of starting in the programming world and have a solid understanding of JavaScript programming by the end of this course.</p><p><strong>Why should I take this course</strong></p><p>If programming in JavaScript is something that you always had a passion for and you always wanted to learn more about that programming language then you should definitely take this course. The first thing that this course will teach you is understanding the logic of programming or in other words how to think like a programmer and how to use with JavaScript . You will also learn various JavaScript&nbsp; concepts as well as create various JavaScript&nbsp; prrograms and applications all over the course.</p><p><strong>There is no risk involved in taking this course</strong></p><p>This course comes with a 100% satisfaction guarantee, this means that if your are not happy with what you have learned, you have <strong>30 days </strong>​to get a complete refund with no questions asked. Also, if there is any concept that you find complicated or you are just not able to understand, you can directly contact me and it will be my pleasure to support you in your learning.</p><p>This means that you can either learn amazing skills that can be very useful in your professional or everyday life or you can simply try the course and if you don't like it for any reason ask for a refund.</p><p><strong>You can't lose with this type of offer !!</strong></p><p><br></p><p><strong>ENROL NOW and start learning today :)</strong></p>", "preview_video": ""}, {"course_id": "1139636", "category": "Teaching & Academics", "sub_category": "Language Learning", "title": "American English Vowels for Indian IT Professionals", "level": "Intermediate Level", "author": "Sheila Lebedenko", "duration": "null", "rating": "4.2", "reviews": "26", "students": "2827", "coupon_code": "FREEVOWEL", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/american-english-vowels-for-indian-it-professionals/?couponCode=FREEVOWEL", "end_day": "2022-03-29 01:37:00+00:00", "headline": "American English Pronunciation for Indian IT Professionals: Part I- Vowels", "description": "<p>In this American English pronunciation course, specifically designed to meet the needs of speakers from India,  learn to accurately produce the American vowels which Indian speakers of English often confuse.  These tricky vowels include learning to distinguish between \"peek\" and \"pick\" and between \"look\" and \"Luke.\"  Also learn to distinguish between \"bone and \"born\" and many other troublesome pairs.  Computer professionals can learn to reduce or minimize their accents in an IT vocabulary context.  Repetition audio practice is included so you can repeat the target phrases until the correct pronunciation becomes part of your muscle memory!</p>", "preview_video": ""}, {"course_id": "4597816", "category": "IT & Software", "sub_category": "IT Certifications", "title": "BCS Professional Certification (ISTQB-ISEB): Practice Tests", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "1.0", "reviews": "1", "students": "1559", "coupon_code": "6A3DE22DDCBCBA4782FC", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/bcs-professional-certification-istqb-iseb-practice-tests/?couponCode=6A3DE22DDCBCBA4782FC", "end_day": "2022-03-28 18:59:00+00:00", "headline": "[New] BCS Professional Certification (ISTQB-ISEB): Practice Tests 2022", "description": "<p><strong>Description</strong></p><p><br></p><p><strong>[New] BCS Professional Certification (ISTQB-ISEB): Practice Tests 2022</strong></p><p>The Certified <strong>ISTQB-ISEB</strong> Practice Test is the most effective and pertinent for you to pass the exam on the first attempt. In fact, you will not only pass your exam but also get a profound understanding of the subject.</p><p><br></p><p><strong>Topics&nbsp; :</strong></p><p>· IS consultancy</p><p>· IT governance and information security.</p><p>· Sustainable IT</p><p>· Project management and support (PPSO)</p><p>· Business analysis</p><p>· Solution development and architecture</p><p>· Software testing</p><p>· IT service management &amp; ITIL</p><p>· Software asset management</p><p>· Data center management</p><p><br></p><p><strong>Exam Details:</strong></p><p><strong>Number of Questions:</strong> 40 Questions</p><p>· <strong>Passing Score: </strong>Above 75%</p><p>· <strong>Test Duration:</strong> 80 minutes</p><p>· <strong>Test Format: </strong>Multiple Choice</p><p><br></p><p>the <strong>ISTQB-ISEB</strong> Certified Tester Foundation Level (BH0-010), like all tests, there is a bit of freedom on BCS's part to exam an array of subjects. That means knowing the majority of <strong>ISEB-SWT2</strong> content is required because they test randomly on the many subjects available. Be aware too that experience requirements often exist because they’ve observed the average person and what is required. You can always push past that to succeed with the <strong>ISEB-SWT2</strong> but it may take some extra work.</p><p><br></p><p><strong>Who this course is for:</strong></p><ul><li><p>Anyone who are preparing for (ISTQB-ISEB) Exam Certification.</p></li></ul><ul><li><p>Students and Professionals who want to do practice and exam preparation for the BCS Professional Certification Exam</p></li><li><p>IT Professionals</p><p><br></p></li></ul>", "preview_video": ""}, {"course_id": "1558028", "category": "Teaching & Academics", "sub_category": "Language Learning", "title": "American English Consonants for Indian IT Professionals", "level": "Intermediate Level", "author": "Sheila Lebedenko", "duration": "null", "rating": "4.6", "reviews": "22", "students": "3679", "coupon_code": "FREECONSONANT", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/american-english-consonants-for-indian-it-professionals/?couponCode=FREECONSONANT", "end_day": "2022-03-29 01:39:00+00:00", "headline": "American English Pronunciation for Indian IT Professionals: Part 2- Consonants", "description": "<p>In this American English pronunciation course, specifically designed to meet the needs of speakers from India,&nbsp; learn to accurately produce the American consonants&nbsp;which Indian speakers of English often confuse. &nbsp;These tricky consonants&nbsp;include learning to distinguish between \"Tap\" and \"Tab\" and between \"vow\" and \"wow.\" &nbsp;Also learn to distinguish between \"Tie\" and \"Die\" and&nbsp; \"IT\" and \"ID\" and many other troublesome pairs. &nbsp;The instructor presents all the consonants in a&nbsp; chart to show how they are all similar and different.&nbsp; From there, you go into detail about how and when to produce each consonant sound.&nbsp; Computer professionals can learn to reduce or minimize their accents&nbsp;in an IT vocabulary context.&nbsp; Learn to pronounce words you are likely to come across at work.&nbsp; Take advantage of the repetition audios in the supplemental materials section to retrain your muscle memory.&nbsp; &nbsp;Each time you listen to the same sentence, you will notice something new about the sentence that you didn't hear the previous times.&nbsp; You will then produce what you hear, so after 6-7 attempts, you will sound quite fluent!&nbsp; But don't stop there.&nbsp; Take this dense course more than once because you will surely notice new details the second time you take it.&nbsp; Once you complete the course, you can attend the instructor's free month live office hour on Zoom, where you can ask questions about the course and receive live correction.&nbsp; &nbsp;The teacher can direct you back to which parts of the course, if any, you need to redo.</p>", "preview_video": ""}, {"course_id": "4610064", "category": "IT & Software", "sub_category": "IT Certifications", "title": "RHCSA Exam Prep Certified System Administrator Practice test", "level": "All Levels", "author": "Ayoub EL ALLALI", "duration": "null", "rating": "0.0", "reviews": "0", "students": "565", "coupon_code": "063082D2548FAB6897F3", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/rhcsa-exam-prep-certified-system-administrator-practice-test/?couponCode=063082D2548FAB6897F3", "end_day": "2022-03-28 22:05:00+00:00", "headline": "GET Red Hat Certified System Administrator (RHCSA) Exam successfully + Explanations", "description": "<p>[March 2022 Updated]: Latest exam questions added</p><p><strong>If you are preparing for (RHCSA) Red Hat Certified System Administrator certification and looking for guidance and resources then you have come to the right place.</strong></p><p><strong>Finally! Pass Red Hat Certified System Administrator (RHCSA) Exam in just 3 days with a 100% money-back guarantee.</strong></p><p><br></p><p>The purpose of this Practice Question Set is to help you pass the Certified <strong>Red Hat Certified System Administrator (RHCSA) </strong>exam. These practice questions will make you very familiar with both the type and the difficulty level of the questions on the (RHCSA) certification test. This practice exam gives you the feeling of reality and is a clue to the questions asked in the actual certification exam.</p><p>Prepare for your tests like a professional using our Certified <strong>RHCSA </strong>online practice tests that others have used to pass the exam in first attempt.</p><p><br></p><p><strong>Overview:</strong></p><p>IT professionals with a Red Hat Certified System Administrator (RHCSA) degree can perform the core systems administration skills required for a Red Hat Enterprise Linux environment. This qualification is earned by successfully passing the Red Hat Certified System Administrator (RHCSA) exam (EX200).</p><p><br></p><p><strong>Topics covered</strong></p><p>We’ve crafted this course to give you the knowledge and technique to pass the (RHCSA) certification in the first time. The practice tests include this topics:</p><ul><li><p>Understand and use essential tools for handling files, directories, command-line environments, and documentation</p></li><li><p>Create simple shell scripts</p></li><li><p>Operate running systems, including booting into different run levels, identifying processes, starting and stopping virtual machines, and controlling services</p></li><li><p>Configure local storage using partitions and logical volumes</p></li><li><p>Create and configure file systems and file system attributes, such as permissions, encryption, access control lists, and network file systems</p></li><li><p>Deploy, configure, and maintain systems, including software installation, update, and core services</p></li><li><p>Manage users and groups</p></li><li><p>Manage security, including basic firewall and SELinux configuration</p></li><li><p>Perform basic container management</p></li></ul><p><br></p><p><strong>Best of luck!</strong></p><p>· <strong>Type : </strong>Multiple Choice – Multi-select – Practice quizz test</p><p>· <strong>Duration : </strong>120 Minutes</p><p>· <strong>Number of Questions : </strong>40-60</p><p><strong>· Passing score : 700</strong></p><p><br></p>", "preview_video": ""}, {"course_id": "4609976", "category": "IT & Software", "sub_category": "IT Certifications", "title": "PMI-PBA Exam Prep Professional in Business Analysis Practice", "level": "All Levels", "author": "Ayoub EL ALLALI", "duration": "null", "rating": "0.0", "reviews": "0", "students": "284", "coupon_code": "8F86C45C1A81A0D2AFBE", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/pmi-pba-exam-prep-professional-in-business-analysis-practice/?couponCode=8F86C45C1A81A0D2AFBE", "end_day": "2022-03-28 22:07:00+00:00", "headline": "Get PMI-PBA Exam Prep Professional in Business Analysis Exam successfully with Explanations", "description": "<p>[january 2022 Updated]: Latest exam questions added.</p><p>Get Ready To Prepare Like You’ve Never Prepared Before!!!</p><p><br></p><p><strong>Finally! Pass Professional in Business Analysis (PMI-PBA) – Associate Exam in just 3 days with a 100% money-back guarantee.</strong></p><p>Preparing for your <strong>PMI-PBA </strong>Certified certification, assess your knowledge of topics on the exam with these practice test questions.<br><br></p><p>The purpose of this Practice Question Set is to help you pass the Certified of <strong>PMI-PBA Professional in Business Analysis – Associate </strong>exam. These practice questions will make you very familiar with both the type and the difficulty level of the questions on the certification test. This practice exam gives you the feeling of reality and is a clue to the questions asked in the actual certification exam.</p><p>Prepare for your tests like a professional using our Certified <strong>PMI-PBA </strong>online practice tests that others have used to pass the exam in first attempt.</p><p><br></p><p><strong>Overview:</strong></p><p>The PMI-PBA (Business analysis) has become a key project management skill. As BA opportunities expand, the Business Analytics (BA) certification can take your career in a new direction.</p><p><br></p><p><strong>Topics covered</strong></p><p>We’ve crafted this course to give you the knowledge and technique to pass the (PMI-PBA) certification exam in the first time. The practice tests include this topics:</p><p>· Domain 1: Needs Assessment (5 tasks) 18%</p><p>· Domain 2: Planning (6 tasks) 22%</p><p>· Domain 3: Analysis (8 tasks) 35%</p><p>· Domain 4: Traceability and Monitoring (5 tasks) 15%</p><p>· Domain 5: Evaluation (4 tasks) 10%</p><p><br></p><p><br></p><p><strong>Best of luck!</strong></p><p>· <strong>Total Examination Questions:</strong>200</p><p>· <strong>Passing Score: </strong>Above 75%</p><p>· <strong>Test Duration:</strong> 240 minutes</p><p>· <strong>Test Format: </strong>Multiple Choice – Multiple select</p><p><br></p>", "preview_video": ""}, {"course_id": "567564", "category": "Business", "sub_category": "Project Management", "title": "Kanban: Agile Kanban Productivity & Efficiency+Agile Scrum", "level": "All Levels", "author": "Paul Ashun", "duration": "null", "rating": "4.2", "reviews": "1214", "students": "42690", "coupon_code": "240322_FREE", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/kanban-board/?couponCode=240322_FREE", "end_day": "2022-03-28 21:12:00+00:00", "headline": "Learn how to reduce bottlenecks, visualize workflow for kanban certification using the kanban board & combine with scrum", "description": "<p><br></p><p><strong><em>\"Scrum Open,&nbsp;Professional Scrum™, Professional Scrum Master™, PSM, PSM I, PSM 1, etc. is the protected brand of Scrum . org. Our course and practice exams are neither endorsed by nor affiliated with Scrum . org.\"</em></strong><br></p><p><strong>Three reasons to TAKE THIS COURSE right now!</strong></p><p>The unique reasons for taking this course are:</p><ol><li><p>Complete, Concise, Confident Overview of Kanban - I cover the theory and give you examples of how the theory is used in industry.</p></li><li><p>Confidence in using Kanban - In a very simple way, I teach you the fundamentals of Kanban and how to use Kanban in industry without going into a class room or spending $£1000..</p></li><li><p>You get to ask me questions and see me respond to every single one of them thoughtfully!</p></li></ol><p>Includes Narration from Christian Carvajal</p><p>What is Kanban?</p><p>Kanban is a method for just in time delivery of tasks (such as products services, support and maintenance) without overloading our workforce . Based on my experience, it is the most popular way to meet just in time delivery for a lean businesses while increasing efficiency.</p><p><strong>Who should take is course?</strong></p><p>Whether you are a product owner, business owner, support/maintenance/dev ops/sales team member, business stakeholder or simply someone who wants the answer to the question \"what is a kanban\", this is definitely the class is for you.</p><p><strong>What will I learn?</strong></p><p>In this class you will learn:</p><ul><li><p>Concise overview of Kanban - Including Origin, How to use The Kanban Board, Workflow, Work In Progress Limits, Priority setting, The Pull System.</p></li><li><p>The facts based on real industry experience and research - The correct terminology and use of Kanban is essential to mastering it. My experience in industry and research into the topic has been used to give you a solid grounding in the most concise way possible.</p></li><li><p>Support/Dev Ops/Product Owners / AgileTeam Members - I give you a complete overview of kanban as used in the business work place without having to do a face to face course saving you hundreds if not thousands of dollars.</p></li></ul><p>The course is video based with no supporting document necessary.</p><p><strong>How is the course structured?</strong></p><p>Each section features an overview of a particular aspect of kanban such as it's Origin, How to use The Kanban Board, Workflow, Work In Progress Limits, Priority setting, The Pull System.&nbsp; Examples are included throughout the course wirh excellent quality video and audio. All is based real world experience.</p><p>Inspired by God, the Bible, my mother and father, David J. anderson.</p>", "preview_video": ""}, {"course_id": "4300761", "category": "Teaching & Academics", "sub_category": "Other Teaching & Academics", "title": "General bacteriology a concise course", "level": "All Levels", "author": "Mohamed AL ashram", "duration": "null", "rating": "4.0", "reviews": "30", "students": "4510", "coupon_code": "E04FC08FC5E374934FA3", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/general-bacteriology-a-concise-course/?couponCode=E04FC08FC5E374934FA3", "end_day": "2022-03-28 04:08:00+00:00", "headline": "Bacteriology essential review in half hour", "description": "<p>Bacteriology basics principles in half hour in in easy way it is suitable for professional need to refresh their knowledge and for beginners&nbsp; i and for student in secondary school and medical student science students agriculture students</p><p>In this course we introduce basics in interesting methods&nbsp; slides quizzes&nbsp; assignments we give a brief about history of microbiology&nbsp; &nbsp; &nbsp; he beginnings of bacteriology paralleled the development of the microscope. The first person to see microorganisms was probably the Dutch naturalist&nbsp; van Leeuwenhoek, who in 1683 described some animalcules, as they were then called, in water, saliva, and other substances. These had been seen with a simple lens magnifying about 100–150 diameters. The organisms seem to correspond with some of the very large forms of bacteria as now recognized.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; and pioneer participate in revolution of the science&nbsp; &nbsp; Robert Koch who discover anthracis&nbsp; tuberculosis Koch postulate&nbsp; Pasteur who discovered pasteurization fermentation&nbsp; autoclaves hot air oven&nbsp; lister who discovered sterilization it is science susceptibility to the disinfectant&nbsp; is different speak about morphology how bacteria appear under microscope after it is stained it appears in form of cocci bacilli comma shape&nbsp; filamentous spiral we give brief notes on bacterial nutrion bacterial growth bacterial products we speak about bacterial pathogenicity and virulence we give example diphtheria how microbiologist participate in identifying the cause of disease and treat&nbsp; &nbsp;it and make vaccine </p>", "preview_video": ""}, {"course_id": "1762512", "category": "Business", "sub_category": "Entrepreneurship", "title": "Partnership Accounting", "level": "Intermediate Level", "author": "Robert (Bob) Steele", "duration": "null", "rating": "4.3", "reviews": "109", "students": "31596", "coupon_code": "58859FC3863F1B9B01D4", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/partnership-accounting/?couponCode=58859FC3863F1B9B01D4", "end_day": "2022-03-27 04:47:00+00:00", "headline": "Partnership formation, net income allocation, adding new partners, liquidation, partner leaving, closing process", "description": "<p><strong>Partnership accounting will cover accounting topics related to a partnership form of business entity.</strong></p>\n\n<p><strong>This partnership course will focus on the accounting issues that are different in a partnership as compared to other types of entities like a sole proprietorship or corporations. As we focus on the differences, we always want to keep in mind the similarities in accounting for different business entities. Most of what we have learned about the double entry accounting system and day to day accounting transactions in prior courses will remain the same. We are concentrating on the areas that will different because the differences are where the new information lies. </strong>\n\n  </p>\n\n<p><strong>We will start by defining what a partnership is and comparing the characteristics of a partnership with other business entities. Understanding one business entity and its components are often best learned by contrasting them with the attributes of others, always considering the relative pros and cons, thinking of situations and circumstances that would benefit one form of business entity over another. </strong>\n\n  </p>\n\n<p><strong>The course will discuss the process for setting up a new partnership, typically starting with the partners contributing capital to the partnership, requiring us to record the contribution and the capital accounts. </strong>\n\n  </p>\n\n<p><strong>We will discuss the allocation of net income to the partners, one of the primary differences between a partnership type of entity and other types of entities. There is a lot of flexibility for net income allocation in a partnership, and this is one of its primary benefits. </strong>\n\n  </p>\n\n<p><strong>The course will cover the recording of partnership draws, how to record them, as well as the closing process for a partnership. The steps of the closing process will be much the same as those for any business entity except for the allocation of net income to the partners. </strong>\n\n  </p>\n\n<p><strong>We will consider the situation where a partner leaves a partnership or where a new partner is added. The transactions related to a partner leaving or being added is unique to a partnership entity. </strong>\n\n  </p>\n\n<p><strong>The course will cover a partnership liquidation process or closing process. The liquidation process is a very useful exercise for any entity because it allows us to do take apart a business. We have discussed the process of putting new busses together in prior courses, but to fully understand how something works we must also take it apart. The liquidation process is particularly important for a partnership entity because it emphasizes the capital accounts and the process necessary to reduce the likelihood of problems during the process. </strong>\n\n  </p>\n\n<p><strong>We also include a comprehensive problem designed to take a step back and consider all the similarities between business entities so that we can put the differences we have studied in this course into perspective. The comprehensive problem will cover the entire accounting cycle from entering journal entries and posting to the general ledger, to recording adjusting entries and creating the financial statements, to the closing process. </strong>\n\n  </p>\n\n<p><strong>The course also includes definition and key accounting terms related to partnerships. </strong>\n\n  </p>\n\n<p><strong>In addition to the instructional videos, this course will include downloadable</strong>\n\n  </p>\n\n<p><strong>•    Downloadable PDF Files</strong>\n\n  </p>\n\n<p><strong>•    Excel Practice Files</strong>\n\n  </p>\n\n<p><strong>•    Multiple Choice Practice Questions</strong>\n\n  </p>\n\n<p><strong>•    Short Calculation Practice Questions</strong>\n\n  </p>\n\n<p><strong>•    Discussion Questions</strong>\n\n  </p>\n\n<p><strong>The PDF files allow us to download reference information we can use offline and as a guide to help us work through the material.</strong>\n\n  </p>\n\n<p><strong>Excel practice files will be preformatted so that we can focus on the adjusting process and learning some of the basics of Excel, like addition, subtraction, and cell relationships.</strong>\n\n  </p>\n\n<p><strong>Multiple choice example question helps us improve our test-taking skills by reducing the information into the size and format of multiple choice questions and discussing how to approach these questions.</strong>\n\n  </p>\n\n<p><strong>Short calculation questions help us reduce problems that have some calculation down to a short format that could be used in multiple choice questions.</strong>\n\n  </p>\n\n<p><strong>Discussion Question will provide an opportunity to discuss these topics with the instructor and other students, a process many students find very helpful because it allows us to see the topic from different viewpoints.</strong>\n\n  </p>\n\n<p><strong>Who will we be learning from?</strong>\n\n  </p>\n\n<p><strong>You will be learning from somebody who has technical experience in accounting concepts and in accounting software like QuickBooks, as well as experience teaching and putting together curriculum.</strong>\n\n  </p>\n\n<p><strong>You will be learning from somebody who is a:</strong>\n\n  </p>\n\n<p><strong>•    CPA – Certified Public Accountant</strong>\n\n  </p>\n\n<p><strong>•    CGMA – Chartered Global Management Accountant</strong>\n\n  </p>\n\n<p><strong>•    Master of Science in Taxation</strong>\n\n  </p>\n\n<p><strong>•    CPS – Certifies Post-Secondary Instructor</strong>\n\n  </p>\n\n<p><strong>•    Curriculum Development Export</strong>\n\n  </p>\n\n<p><strong>As a practicing CPA the instructor has worked with many technical accounting issues and helped work through them and discuss them with clients of all levels.</strong>\n\n  </p>\n\n<p><strong>As a CPS and professor, the instructor has taught many accounting classes and worked with many students in the fields of accounting, business, and business applications.</strong>\n\n  </p>\n\n<p><strong>The instructor also has a lot of experience designing courses and learning how students learn best and how to help students achieve their objectives. Experience designing technical courses has also benefit in being able to design a course in a logical fashion and deal with problems related to technical topics and the use of software like QuickBooks Pro.</strong>\n\n  </p>\n\n<p><strong>Content Includes:</strong>\n\n  </p>\n\n<p><strong>•    Process for setting up a partnership</strong>\n\n  </p>\n\n<p><strong>•    The allocation of net income to partners</strong>\n\n  </p>\n\n<p><strong>•    The recording of partner withdrawals</strong>\n\n  </p>\n\n<p><strong>•    Recording the partnership closing process</strong>\n\n  </p>\n\n<p><strong>•    Journal entries related to a partner leaving the partnership</strong>\n\n  </p>\n\n<p><strong>•    Journal entries related to adding a new partner to the partnership</strong>\n\n  </p>\n\n<p><strong>•    The liquidation process for a partnership</strong>\n\n  </p>\n\n<p><strong>•    A comprehensive problem on the accounting cycle</strong>\n\n  </p>\n\n<p><strong>•    Key terms definitions and explanations related to partnerships</strong>\n\n</p>", "preview_video": ""}, {"course_id": "3736042", "category": "Design", "sub_category": "Graphic Design & Illustration", "title": "The Art Of Drawing Cartoon Comic Strips [NEW]", "level": "All Levels", "author": "Red Jacobs Production", "duration": "null", "rating": "4.5", "reviews": "60", "students": "14857", "coupon_code": "85ABD787D440E131730D", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/the-art-of-drawing-cartoon-comic-strips/?couponCode=85ABD787D440E131730D", "end_day": "2022-03-26 11:27:00+00:00", "headline": "Learn  to Draw Colored Cartoon Character Comic Strips and Express your Ideas with Cartoons.", "description": "<p><strong>NOW IS THE MOMENT </strong></p><p><strong>Updated - 18/10/2021</strong></p><p>Do You Want To Be a Creative?</p><p>Join Thousands of students&nbsp; learn how to Draw &amp; Create&nbsp; cartoon Comic Strips.</p><p>This Masterclass is the Compilation 0f 13 years of my Life's Learning &amp;&nbsp; Pesronal experience on the Subject of Drawing Cartoons.</p><p>Do You want to learn how to draw Professsional cartoon characters that will enable you create <strong>amazing comic strips</strong>?</p><p>In this very in-depth Course, I want to share my (<strong><em>over 13years of Experience</em></strong>) Cartoon Comic Strip Creation process with You. I will take You through the very <strong><em>basics in Drawing Cartoon Characters so that You can start creating Your own Cartoon Characters straight from your imagination.</em></strong></p><p><em>My Name is </em><strong><em>T.S Amachree, </em></strong>ever since i was a kid, I've been passionate about Drawing and Scribbling Cartoon Characters. Its one thing I am really good at; and over the years, I've been privileged to have Great Teachers that Inspired and guided me along the path in making Great Cartoon Comic strips.</p><p>You will learn how to Draw and Create Cartoon Comic Strips. Each lesson is made super Easy; Step- by - step Guide in Real Time.</p><p>With a Cartoon Comic Strip Examples; featuring some of my best Cartoon Characters.</p><p>From Sketching Your Ideas on Paper, Drawing the Cartoon Characters to Coloring &amp; Texting the final Project on Photoshop.</p><p><br></p><p><strong><em>Everything You'd need to know about Creating Your Own Cartoon Comic Strips; Straight from your ideas and imagination.</em></strong></p><p>The Best Part is; <strong>It Doesn't Matter If You Do Not Know How To Draw</strong>; This course is made Super Easy. Starting with the Very First Principle of Drawing Cartoon Character.</p><p><em>You don't need to use a Graphic tabs, Artist Pencil or Special Brush for this Course.</em></p><p>All you need is the super affordable, simple a <strong>Ball Point Pen (BIC Biro)</strong>.</p><p>This Course will teach You new skills and further expand your knowledge in Drawing Cartoon Characters and Creating Cartoon Comic Strips.</p><p>You can Start making Cartoon Comic Strips for Newspapers, Magazines, websites, social media and even earn more money through ads.</p><p>I even use comic strips to draw up Story block ideas for videos for some of my clients; it helps to communicate a perfect visual understanding of the Proposed Video.</p><p>Enroll now; and Enjoy a lifetime and instant access to the entire course.</p><p><strong>a 30 Day Money Back Guarantee.</strong></p><p><em>Never Despise or undervalue your own Creative expressions or Art form.</em></p><p><em>The goal is not to draw something perect but to create Consistency.</em></p><p>Don't Wait Sign up Now - Take Action.</p><p><strong>(G)</strong></p><p><br></p>", "preview_video": ""}, {"course_id": "4488554", "category": "Business", "sub_category": "Business Strategy", "title": "Corporate ESG Fundamental for Business leaders", "level": "Beginner Level", "author": "Americana Chen", "duration": "null", "rating": "4.4", "reviews": "74", "students": "5280", "coupon_code": "FREEESGWISDP", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/corporate-esg-fundamental/?couponCode=FREEESGWISDP", "end_day": "2022-03-27 14:12:00+00:00", "headline": "An introductory course for entrepreneurs to understand ESG and start preparing for ESG reporting", "description": "<p>According to a survey by Edelman, 96% of U.S. investors expect the firm they invested in to increase the prioritization of ESG. From CSR - corporate social responsibility to ESG - environmental, social and governance, how businesses are impacting the environment and the social communities around them had become increasingly important.</p><p>So what is ESG? Why do businesses need to start addressing ESG related issues? What could be included in each of the three categories? And what makes a good ESG report?</p><p>This course will teach you the fundamentals of ESG, including:<br>- The definition of ESG</p><p>- Benefits of adopting ESG strategies to businesses</p><p>- Elaboration on each of the 3 aspects</p><p>- Best practices of a good ESG report</p><p>- Case Study</p><p>By finishing this course, you would be expected to be able to read through an ESG report and identify what are the highlights and what could be improved - which you will practice in the final assignment.<br><br>----<br>WISDP was registered in Hong Kong in October 2017 as a Company Limited by Guarantee to drive the training and foster professional recognition of sustainable development in the business, education and public sectors. It has formally been launched in February 2018 and is striving to establish strategic partnerships with like-minded institutions to advocate the UN Agenda 2030. WISDP operates in the form of a Learned Society and a Research Institute and works with a view to providing training programmes for professionals. It has established memberships and certification processes to recognize the training, experiences and contributions of individuals and corporations to sustainable development.</p>", "preview_video": ""}, {"course_id": "4377144", "category": "Development", "sub_category": "No-Code Development", "title": "Excel Tips and trick : Learn MS Excel by making 7 Projects", "level": "Beginner Level", "author": "Yassin Marco", "duration": "null", "rating": "4.1", "reviews": "40", "students": "8506", "coupon_code": "739DA1322E9EBB7B1F43", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/excel-tips-and-trick-learn-ms-excel-by-making-7-projects/?couponCode=739DA1322E9EBB7B1F43", "end_day": "2022-03-28 15:39:00+00:00", "headline": "Boost your understanding of Microsoft Excel - Learn how to use MS Excel by creating over 7 simple Excel projects", "description": "<p>Learning how to properly work with Microsoft can be very complicated espescially if you never worked with this applicaiton before. This is why, this course have been created, to help you learn how to work with Microsoft Excel and what are all the mazing things that you can do with this application. If you:</p><p>- Need to learn the basics of Microsoft Excel for work</p><p>- Always wanted to create various projects with this application</p><p>- Are currently in school and have to understand some Excel concepts</p><p>- are simply curious about this Microsoft App</p><p>Then you are definely at the right place and will probably love this course and everything that it has to offer. Indeed, not only you will learn and understand all the basic concepts and everything aroud the microsoft Excel application but you will have a lot of practice throught out this course. The goal here is that by the end of this course you have a solid and strong understand of how to use microsoft Excel in order to create your own basic applications that will allow you to do various things like the different projects that we will create in this course.</p><p><br></p><p><strong>The structure of the course</strong></p><p>The way this course have been built, is made to help you understand and learn everything you need to know about Java script. Indeed, you will understand all the basics of this programming language. From the starting point where you are going to learn how to use simple Excel buttons or how to open and save your current project to the more advanced part that contains things such as IF statement, lookups or various other excel functiosn and various practical projects, this course has everything you need to start your Microsoft Excel journey. Also, this course has been created not only to help you learn Microsoft Excel but to also, help you have a clear understanding of all the basics of this Application and what you can do with it. Also, this course will teach something very important concepts that can be used everytime that you work with this application. Indeed, by creating various projects, you will learn to think like a developper and this can be useful not only in Excel apps creation but even if you start programming in any object oriented language like python for Example. In other words, if you don't have any Excel or programming experience prior to this course, by completing it you will learn the programming logic and this will help succed not only with microsoft excel functions but it's useful if you start programming in any object oriented programming language.</p><p>Also, this course is built around a very simple but effective logic that is learning by practice. Indeed, this simply means that this course is definely not theoritical even if it contains some classes that present various MS Excel concepts. In other words, this course is built on a logic of learning by practice . This means that you will find plenty of projects&nbsp; all over the course to help you understand and master this Application&nbsp; to finaly achieve your end goal of learning how to use microsoft Excel.</p><p><br></p><p><strong>For who is this course designed</strong></p><p>There is a lot of Microsoft Excel courses that exist all over the internet. But, this course is definely different. Indeed, all the concepts that can be found in this course are simplified to help you understand them more in depth and a lot easier. Also, it's important to mention that each element in this course is presented with a multitude of various practical examples that will allow you to practice everything that you will learn all over the course. In other words, if you never wrote a single excel function or did any use of this application prior this course and you always wanted to start somewhere then you will probably love this course. The way this course is presented and structured is here to help you achieve your obective of starting to work with microsoft Excel and have a solid understanding of this application by the end of this course.</p><p><br></p><p><strong>Why should I take this course</strong></p><p>If wotking with Excel is something that you always had a passion for and you always wanted to learn more about this amazing apoplication then you should definitely take this course. The first thing that this course will teach you is understanding the logic of around this application or in other words how what are different uses that you can make with it and the various real life situations where Excel can be useful. You will also learn various MS Excel concepts as well as create various Projects and simple applications all over the course.</p><p><br></p><p><strong>There is no risk involved in taking this course</strong></p><p>This course comes with a 100% satisfaction guarantee, this means that if your are not happy with what you have learned, you have <strong>30 days </strong>​to get a complete refund with no questions asked. Also, if there is any concept that you find complicated or you are just not able to understand, you can directly contact me and it will be my pleasure to support you in your learning.</p><p>This means that you can either learn amazing skills that can be very useful in your professional or everyday life or you can simply try the course and if you don't like it for any reason ask for a refund.</p><p><strong>You can't lose with this type of offer !!</strong></p><p><br></p><p><strong>ENROL NOW and start learning today :)</strong></p><p><br></p>", "preview_video": ""}, {"course_id": "4151682", "category": "IT & Software", "sub_category": "Other IT & Software", "title": "Catia V5 Zero to Hero! Catia V5 Beginners Course in CAD", "level": "Beginner Level", "author": "Philipp Suppinger", "duration": "null", "rating": "4.6", "reviews": "25", "students": "829", "coupon_code": "CATIAV5UDEMYFORFREE", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/catia-v5-from-zero-to-hero-beginners-course/?couponCode=CATIAV5UDEMYFORFREE", "end_day": "2022-03-28 15:26:00+00:00", "headline": "Learn to design your parts with CAD Software Catia V5 R19/R20/R21 by German automotive engineer. Expert in Catia V5 CAD", "description": "<p>This Course is optimized for beginners in CAD Software. From zero knowledge to being able to create Drawings, Parts, Shapes or Data for 3D Printers. Throughout this course I will take you by the hand at your first steps using this software. I designed this course having in mind what questions I had when learned this software at the university, with this technique I think I found a good way to teach you this topic. All Lessons are supported with practical lessons so that you can do a lot of exercises during this course. Sometimes less is more, that`s why I don`t explain every function there is. What I teach you is what you will use 95% of your time. By that you will get the fastest learning success. For those who want more Information, don`t worry! I do have a Bonus Lecture at the end which will explain more functions and shortcuts how to achieve your goals faster.</p><p>I would be pleased if you check out the video material below and enroll in this course!</p><p>If you are not happy, with what you are seeing you will get a refund within the first 30 days. </p><p>See you in class.</p><p>Cheers Philipp</p>", "preview_video": ""}, {"course_id": "4607948", "category": "IT & Software", "sub_category": "IT Certifications", "title": "AZ-400 Microsoft Azure DevOps Solutions Practice Tests 2022", "level": "All Levels", "author": "It Exam Academy", "duration": "null", "rating": "0.0", "reviews": "0", "students": "1203", "coupon_code": "8DDD69E945C5D1C0D186", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/az-400-microsoft-azure-devops-solutions-practice-tests-2022-j/?couponCode=8DDD69E945C5D1C0D186", "end_day": "2022-03-28 18:56:00+00:00", "headline": "AZ-400 Microsoft Azure DevOps Solutions Practice Tests 2022 [New] : Test your knowledge", "description": "<p><strong>Description</strong></p><p><br></p><p><strong>AZ-400 Microsoft Azure DevOps Solutions Practice Exams [Learn &amp; Practice] 2022.</strong></p><p><br></p><p>These practice tests have been made after a lot of research and it would definitely help you in clearing the <strong>AZ-400 Microsoft Azure DevOps Solutions CERTIFICATION</strong> in the first attempt. If you combine practice exams with reading and hands-on lab time you <strong>greatly increase your chances of passing the exam</strong>.</p><p><br></p><p><strong>Topics:</strong></p><p><br></p><ul><li><p><strong>*** Develop an instrumentation strategy ***</strong></p><p><br></p><p>Design and implement logging</p><p>Design and implement telemetry</p><p>Integrate logging and monitoring solutions</p></li></ul><ul><li><p><strong>*** Develop a security and compliance plan ***</strong></p><p><br></p><p>Design an authentication and authorization strategy</p><p>Design a sensitive information management strategy</p><p>Develop security and compliance</p><p>Design governance enforcement mechanisms</p><p><br></p></li><li><p><strong>***Manage source control ***</strong></p><p><br></p><p>Develop a modern source control strategy</p><p>Plan and implement branching strategies for the source code</p><p>Configure repositories</p><p>Integrate source control with tools</p><p><br></p></li></ul><ul><li><p><strong>***Develop a Site Reliability Engineering (SRE) strategy ***</strong></p><p><br></p><p>Develop an actionable alerting strategy</p><p>Design a failure prediction strategy</p><p>Design and implement a health check</p><p><br></p></li><li><p><strong>***Facilitate communication and collaboration ***</strong></p><p><br></p><p>Communicate deployment and release information with business stakeholders</p><p>Generate DevOps process documentation</p><p>Automate communication with team members</p><p><br></p></li><li><p><strong>***Define and implement continuous integration ***</strong></p><p><br></p><p>Design build automation</p><p>Design a package management strategy</p><p>Design an application infrastructure management strategy</p><p>Design a process for standardizing builds across organization</p><p><br></p></li><li><p><strong>***Define and implement a continuous delivery and release management strategy ***</strong></p><p><br></p><p>Develop deployment scripts and templates</p><p>Implement an orchestration automation solution</p><p>Plan the deployment environment strategy</p></li></ul><p><br></p><p>You can be able to see which answers were correct and which were not by clicking on \"Review Questions\" button when you complete or end the practice tests.</p><p><br></p><p><strong>good luck!!!</strong></p>", "preview_video": ""}, {"course_id": "1674460", "category": "Marketing", "sub_category": "Branding", "title": "Personal Branding System: UNIQUE Secret for YOUR Success", "level": "All Levels", "author": "Susmita Dutta", "duration": "null", "rating": "4.1", "reviews": "115", "students": "25020", "coupon_code": "MAR2022FREE001", "preview_img": "null", "coupon_link": "https://www.udemy.com/course/personal-branding-master-course/?couponCode=MAR2022FREE001", "end_day": "2022-03-28 15:20:00+00:00", "headline": "Create your UNIQUE Brand to make people remember YOU", "description": "<p><strong>**Course Updated - March 2022**</strong></p><p><strong>&gt;&gt; COURSE REGULARLY UPDATED: NEW TIPS, MORE LESSONS &lt;&lt;</strong></p><p><strong>&gt;&gt; CERTIFIED COACH, SPEAKER AND TRAINER &lt;&lt;</strong></p><p><strong>&gt;&gt; OVER 180,000 STUDENTS IN TOTAL &lt;&lt;</strong></p><p><br></p><p><strong>Personal positioning is your own branding, it is simply what people think WHO you are</strong>. What we generally do is let people brand us… That is we let them judge what we are rather than telling them who we are… This is because we ourselves are scared and not sure about how we must portrait ourselves… So, what we do is let them judge who we are??</p><p>Positioning is not a statement about you – It’s a statement that captures who you are, it’s not a factual claim, but rather an emotional reason for people to want to be around you.</p><p>The positioning statement should be very crisp and powerful. The major problem with this is that half of the people might just start thinking about you in a variety of ways which might not be beneficial for your growth.&nbsp;</p><p><strong>The world is an absolutely unfair place and positioning gives you an extremely unfair advantage</strong></p><p>Raise your hand, say “Aye” &nbsp;if you would like to have that unfair advantage? Positioning is that guaranteed formula that business will keep coming to you, you won’t have to go scouting for it. Whatever you do, just do this right… And my name is Susmita Dutta and in this course, I am going to tell you exactly&nbsp;<strong>how you too can do this for yourself</strong></p>", "preview_video": ""}]}